; ModuleID = 'build_script_build.32814dd1bd87794d-cgu.0'
source_filename = "build_script_build.32814dd1bd87794d-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"alloc::boxed::Box<dyn core::ops::function::FnMut() -> core::result::Result<(), std::io::error::Error> + core::marker::Send + core::marker::Sync>" = type { %"core::ptr::unique::Unique<dyn core::ops::function::FnMut() -> core::result::Result<(), std::io::error::Error> + core::marker::Send + core::marker::Sync>", %"alloc::alloc::Global" }
%"core::ptr::unique::Unique<dyn core::ops::function::FnMut() -> core::result::Result<(), std::io::error::Error> + core::marker::Send + core::marker::Sync>" = type { %"core::ptr::non_null::NonNull<dyn core::ops::function::FnMut() -> core::result::Result<(), std::io::error::Error> + core::marker::Send + core::marker::Sync>", %"core::marker::PhantomData<dyn core::ops::function::FnMut() -> core::result::Result<(), std::io::error::Error> + core::marker::Send + core::marker::Sync>" }
%"core::ptr::non_null::NonNull<dyn core::ops::function::FnMut() -> core::result::Result<(), std::io::error::Error> + core::marker::Send + core::marker::Sync>" = type { { ptr, ptr } }
%"core::marker::PhantomData<dyn core::ops::function::FnMut() -> core::result::Result<(), std::io::error::Error> + core::marker::Send + core::marker::Sync>" = type {}
%"alloc::alloc::Global" = type {}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "47ca48354a1eae17c7180e4e001a6ff")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "6d9a64dc1e997260cfd7fe3b035f14f8")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<std::io::error::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::error::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "f480c8c44689d52dff219efc9b7db982")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !33, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !35, templateParams: !23, identifier: "1cd980d205e56571776aca6f03c11c19")
!33 = !DINamespace(name: "error", scope: !34)
!34 = !DINamespace(name: "io", scope: !17)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !32, file: !2, baseType: !37, size: 64, align: 64, flags: DIFlagPrivate)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !38, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !39, templateParams: !23, identifier: "e75ea69e5bea2e1428c4613a89010f4f")
!38 = !DINamespace(name: "repr_bitpacked", scope: !33)
!39 = !{!40, !49}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !37, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagPrivate)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !42, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !45, templateParams: !47, identifier: "59004c9764b8f8a0c7eeffd3340ced68")
!42 = !DINamespace(name: "non_null", scope: !43)
!43 = !DINamespace(name: "ptr", scope: !44)
!44 = !DINamespace(name: "core", scope: null)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !41, file: !2, baseType: !6, size: 64, align: 64, flags: DIFlagPrivate)
!47 = !{!48}
!48 = !DITemplateTypeParameter(name: "T", type: !7)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !37, file: !2, baseType: !50, align: 8, offset: 64, flags: DIFlagPrivate)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !51, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !52, identifier: "569afd513d273a4490c166c198a7dead")
!51 = !DINamespace(name: "marker", scope: !44)
!52 = !{!53}
!53 = !DITemplateTypeParameter(name: "T", type: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !55, templateParams: !23, identifier: "398d1288e8061f12de8bd6fd8c08802b")
!55 = !{!56}
!56 = !DICompositeType(tag: DW_TAG_variant_part, scope: !54, file: !2, size: 128, align: 64, elements: !57, templateParams: !23, identifier: "76cee87d7fe432197885aa7a2ffa5185", discriminator: !147)
!57 = !{!58, !125, !129, !143}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !56, file: !2, baseType: !59, size: 128, align: 64, extraData: i8 0)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !54, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !60, templateParams: !63, identifier: "dfa600576d4397fa53b5486b11f93248")
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !59, file: !2, baseType: !62, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!62 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!63 = !{!64}
!64 = !DITemplateTypeParameter(name: "C", type: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !33, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !67, templateParams: !23, identifier: "8831490451064e3fa1fe6f0bb2f08da")
!67 = !{!68, !114}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !66, file: !2, baseType: !69, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !33, file: !2, baseType: !70, size: 8, align: 8, flags: DIFlagEnumClass, elements: !71)
!70 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!72 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!76 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!78 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!79 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!80 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!81 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!82 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!83 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!84 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!85 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!86 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!87 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!88 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!89 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!90 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!91 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!92 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!93 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!94 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!95 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!96 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!97 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!98 = !DIEnumerator(name: "QuotaExceeded", value: 26, isUnsigned: true)
!99 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!100 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!101 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!102 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!103 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!104 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!105 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!106 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!107 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!108 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!109 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!110 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!111 = !DIEnumerator(name: "InProgress", value: 39, isUnsigned: true)
!112 = !DIEnumerator(name: "Other", value: 40, isUnsigned: true)
!113 = !DIEnumerator(name: "Uncategorized", value: 41, isUnsigned: true)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !66, file: !2, baseType: !115, size: 128, align: 64, flags: DIFlagPrivate)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !116, templateParams: !23, identifier: "68ed1afd65035993a471745eb0e37223")
!116 = !{!117, !120}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !115, file: !2, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64, dwarfAddressSpace: 0)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !23, identifier: "19b38f3bef7166aedba06b9f63e81a6e")
!120 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !115, file: !2, baseType: !121, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 10]", baseType: !122, size: 64, align: 64, dwarfAddressSpace: 0)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 640, align: 64, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 10, lowerBound: 0)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !56, file: !2, baseType: !126, size: 128, align: 64, extraData: i8 1)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !54, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !127, templateParams: !63, identifier: "30112b0c615f7210a58d0fc3082945ff")
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !126, file: !2, baseType: !69, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !56, file: !2, baseType: !130, size: 128, align: 64, extraData: i8 2)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !54, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !131, templateParams: !63, identifier: "4da972fbd9860b042cf06ffba1a505de")
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !130, file: !2, baseType: !133, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !134, size: 64, align: 64, dwarfAddressSpace: 0)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !33, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !135, templateParams: !23, identifier: "f1d57dcdcc2cfc6a470e4cf980ed4dc4")
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !134, file: !2, baseType: !69, size: 8, align: 8, offset: 128, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !134, file: !2, baseType: !138, size: 128, align: 64, flags: DIFlagPublic)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !139, templateParams: !23, identifier: "9277eecd40495f85161460476aacc992")
!139 = !{!140, !142}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !138, file: !2, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !138, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !56, file: !2, baseType: !144, size: 128, align: 64, extraData: i8 3)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !54, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !145, templateParams: !63, identifier: "f4e520f88fd6d9c2dce2bdf36a67cdde")
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !144, file: !2, baseType: !65, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!147 = !DIDerivedType(tag: DW_TAG_member, scope: !54, file: !2, baseType: !70, size: 8, align: 8, flags: DIFlagArtificial)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "<core::num::error::ParseIntError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::num::error::ParseIntError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !151, vtableHolder: !156, templateParams: !23, identifier: "18066866264bfe538b3a0629efb70bbc")
!151 = !{!152, !153, !154, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !150, file: !2, baseType: !6, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !150, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !150, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !150, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParseIntError", scope: !157, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !159, templateParams: !23, identifier: "ed6e8da1c18c3a018d5ebadd34256cc6")
!157 = !DINamespace(name: "error", scope: !158)
!158 = !DINamespace(name: "num", scope: !44)
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !156, file: !2, baseType: !161, size: 8, align: 8, flags: DIFlagProtected)
!161 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IntErrorKind", scope: !157, file: !2, baseType: !70, size: 8, align: 8, flags: DIFlagEnumClass, elements: !162)
!162 = !{!163, !164, !165, !166, !167}
!163 = !DIEnumerator(name: "Empty", value: 0, isUnsigned: true)
!164 = !DIEnumerator(name: "InvalidDigit", value: 1, isUnsigned: true)
!165 = !DIEnumerator(name: "PosOverflow", value: 2, isUnsigned: true)
!166 = !DIEnumerator(name: "NegOverflow", value: 3, isUnsigned: true)
!167 = !DIEnumerator(name: "Zero", value: 4, isUnsigned: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "<&core::option::Option<&str> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<&str> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !171, vtableHolder: !176, templateParams: !23, identifier: "90dcca37c66f64a79010d6f56978b36d")
!171 = !{!172, !173, !174, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !170, file: !2, baseType: !6, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !170, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !170, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !170, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<&str>", baseType: !177, size: 64, align: 64, dwarfAddressSpace: 0)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&str>", scope: !178, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !179, templateParams: !23, identifier: "2bc48ac156eb0b9af65ce106fe40b972")
!178 = !DINamespace(name: "option", scope: !44)
!179 = !{!180}
!180 = !DICompositeType(tag: DW_TAG_variant_part, scope: !177, file: !2, size: 128, align: 64, elements: !181, templateParams: !23, identifier: "3bde3af7500c47c6f136143232c5529f", discriminator: !190)
!181 = !{!182, !186}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !180, file: !2, baseType: !183, size: 128, align: 64, extraData: i64 0)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !177, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !184, identifier: "9c8f211130fd2063475b87f1b15cfe78")
!184 = !{!185}
!185 = !DITemplateTypeParameter(name: "T", type: !138)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !180, file: !2, baseType: !187, size: 128, align: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !177, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !188, templateParams: !184, identifier: "9166cc963d4162e8d052ac2863ecae1b")
!188 = !{!189}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !187, file: !2, baseType: !138, size: 128, align: 64, flags: DIFlagPublic)
!190 = !DIDerivedType(tag: DW_TAG_member, scope: !177, file: !2, baseType: !191, size: 64, align: 64, flags: DIFlagArtificial)
!191 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "<&&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !194, isLocal: true, isDefinition: true)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !195, vtableHolder: !200, templateParams: !23, identifier: "e3020750280002cd6ab7764f2929e04a")
!195 = !{!196, !197, !198, !199}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !194, file: !2, baseType: !6, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !194, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !194, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !194, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !138, size: 64, align: 64, dwarfAddressSpace: 0)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "<&core::num::error::IntErrorKind as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::num::error::IntErrorKind as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !204, vtableHolder: !209, templateParams: !23, identifier: "31ef786531aa05267803e9182a3e03be")
!204 = !{!205, !206, !207, !208}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !203, file: !2, baseType: !6, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !203, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !203, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !203, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::num::error::IntErrorKind", baseType: !161, size: 64, align: 64, dwarfAddressSpace: 0)
!210 = !{i32 8, !"PIC Level", i32 2}
!211 = !{i32 7, !"PIE Level", i32 2}
!212 = !{i32 2, !"RtLibUseGOT", i32 1}
!213 = !{i32 7, !"Dwarf Version", i32 4}
!214 = !{i32 2, !"Debug Info Version", i32 3}
!215 = !{!"rustc version 1.91.0 (f8297e351 2025-10-28)"}
!216 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !217, producer: "clang LLVM (rustc version 1.91.0 (f8297e351 2025-10-28))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !218, globals: !307, splitDebugInlining: false, nameTableKind: None)
!217 = !DIFile(filename: "/users/ddavis65/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/libc-0.2.177/build.rs/@/build_script_build.32814dd1bd87794d-cgu.0", directory: "/users/ddavis65/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/libc-0.2.177")
!218 = !{!69, !161, !219, !228, !234, !301}
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ProgramKind", scope: !220, file: !2, baseType: !70, size: 8, align: 8, flags: DIFlagEnumClass, elements: !224)
!220 = !DINamespace(name: "common", scope: !221)
!221 = !DINamespace(name: "unix", scope: !222)
!222 = !DINamespace(name: "process", scope: !223)
!223 = !DINamespace(name: "sys", scope: !17)
!224 = !{!225, !226, !227}
!225 = !DIEnumerator(name: "PathLookup", value: 0, isUnsigned: true)
!226 = !DIEnumerator(name: "Relative", value: 1, isUnsigned: true)
!227 = !DIEnumerator(name: "Absolute", value: 2, isUnsigned: true)
!228 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !229, file: !2, baseType: !70, size: 8, align: 8, flags: DIFlagEnumClass, elements: !230)
!229 = !DINamespace(name: "panicking", scope: !44)
!230 = !{!231, !232, !233}
!231 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!232 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!233 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !235, file: !2, baseType: !191, size: 64, align: 64, flags: DIFlagEnumClass, elements: !236)
!235 = !DINamespace(name: "alignment", scope: !43)
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!237 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!238 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!239 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!240 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!241 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!242 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!243 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!244 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!245 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!246 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!247 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!248 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!249 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!250 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!251 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!252 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!253 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!254 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!255 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!256 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!257 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!258 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!259 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!260 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!261 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!262 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!263 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!264 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!265 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!266 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!267 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!268 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!269 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!270 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!271 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!272 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!273 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!274 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!275 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!276 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!277 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!278 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!279 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!280 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!281 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!282 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!283 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!284 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!285 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!286 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!287 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!288 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!289 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!290 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!291 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!292 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!293 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!294 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!295 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!296 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!297 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!298 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!299 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!300 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !302, file: !2, baseType: !70, size: 8, align: 8, flags: DIFlagEnumClass, elements: !304)
!302 = !DINamespace(name: "raw_vec", scope: !303)
!303 = !DINamespace(name: "alloc", scope: null)
!304 = !{!305, !306}
!305 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!306 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!307 = !{!0, !308, !24, !148, !168, !192, !201, !319}
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "<core::num::error::TryFromIntError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !310, isLocal: true, isDefinition: true)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::num::error::TryFromIntError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !311, vtableHolder: !316, templateParams: !23, identifier: "70175ed3fae3671c9607e1d8d47423ac")
!311 = !{!312, !313, !314, !315}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !310, file: !2, baseType: !6, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !310, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !310, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !310, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "TryFromIntError", scope: !157, file: !2, align: 8, flags: DIFlagPublic, elements: !317, templateParams: !23, identifier: "7b2f715ead8a729df5be88b933b1fa3")
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !316, file: !2, baseType: !7, align: 8, flags: DIFlagProtected)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "<&() as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&() as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !322, vtableHolder: !327, templateParams: !23, identifier: "a1254b2543d39071ceef23838446260")
!322 = !{!323, !324, !325, !326}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !321, file: !2, baseType: !6, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !321, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !321, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !321, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!328 = distinct !DISubprogram(name: "rustc_version_cmd", linkageName: "_ZN18build_script_build17rustc_version_cmd17h4215f5cac469d4f5E", scope: !330, file: !329, line: 174, type: !331, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !216, templateParams: !23, retainedNodes: !382)
!329 = !DIFile(filename: "build.rs", directory: "/users/ddavis65/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/libc-0.2.177", checksumkind: CSK_MD5, checksum: "78e9a1fc53d714357233fd58a362793b")
!330 = !DINamespace(name: "build_script_build", scope: null)
!331 = !DISubroutineType(types: !332)
!332 = !{!333, !381}
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Output", scope: !334, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !335, templateParams: !23, identifier: "f901260ccb9218345fff1d9965797640")
!334 = !DINamespace(name: "process", scope: !17)
!335 = !{!336, !344, !380}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !333, file: !2, baseType: !337, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitStatus", scope: !334, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !338, templateParams: !23, identifier: "e953a41b8056ef2d365e69997fbcf3ce")
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !337, file: !2, baseType: !340, size: 32, align: 32, flags: DIFlagPrivate)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitStatus", scope: !341, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !342, templateParams: !23, identifier: "59a9181b8903be4917bd4ae9fabe00b4")
!341 = !DINamespace(name: "unix", scope: !221)
!342 = !{!343}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !340, file: !2, baseType: !62, size: 32, align: 32, flags: DIFlagPrivate)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "stdout", scope: !333, file: !2, baseType: !345, size: 192, align: 64, flags: DIFlagPublic)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !346, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !347, templateParams: !378, identifier: "ff42130aa6076e081f2fa86a2291014b")
!346 = !DINamespace(name: "vec", scope: !303)
!347 = !{!348, !379}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !345, file: !2, baseType: !349, size: 128, align: 64, flags: DIFlagPrivate)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !302, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !350, templateParams: !378, identifier: "aa114707ccbbadecd7b2c53a3bcca26")
!350 = !{!351, !377}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !349, file: !2, baseType: !352, size: 128, align: 64, flags: DIFlagPrivate)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVecInner<alloc::alloc::Global>", scope: !302, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !353, templateParams: !375, identifier: "d9b585b851a6ea35649b1d69fe7eae64")
!353 = !{!354, !367, !372}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !352, file: !2, baseType: !355, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !356, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !357, templateParams: !363, identifier: "c3ca02706589197133726e3ebb88f38a")
!356 = !DINamespace(name: "unique", scope: !43)
!357 = !{!358, !365}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !355, file: !2, baseType: !359, size: 64, align: 64, flags: DIFlagPrivate)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !42, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !360, templateParams: !363, identifier: "8a8631ef5a10de98d90eca8cb5e9c24f")
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !359, file: !2, baseType: !362, size: 64, align: 64, flags: DIFlagPrivate)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !70, size: 64, align: 64, dwarfAddressSpace: 0)
!363 = !{!364}
!364 = !DITemplateTypeParameter(name: "T", type: !70)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !355, file: !2, baseType: !366, align: 8, offset: 64, flags: DIFlagPrivate)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !51, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !363, identifier: "4ee2ce85d019f8c54e6cb96475ed02e")
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !352, file: !2, baseType: !368, size: 64, align: 64, flags: DIFlagPrivate)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "UsizeNoHighBit", scope: !369, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !370, templateParams: !23, identifier: "fb3cc97d9cfd36835928e5fd70db120e")
!369 = !DINamespace(name: "niche_types", scope: !158)
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !368, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !352, file: !2, baseType: !373, align: 8, offset: 128, flags: DIFlagPrivate)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !374, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "261a8454d8f730546a4c59211f97b50b")
!374 = !DINamespace(name: "alloc", scope: !303)
!375 = !{!376}
!376 = !DITemplateTypeParameter(name: "A", type: !373)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !349, file: !2, baseType: !366, align: 8, offset: 128, flags: DIFlagPrivate)
!378 = !{!364, !376}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !345, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "stderr", scope: !333, file: !2, baseType: !345, size: 192, align: 64, offset: 192, flags: DIFlagPublic)
!381 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!382 = !{!383, !384, !396, !743, !746, !748, !750, !752, !754}
!383 = !DILocalVariable(name: "is_clippy_driver", arg: 1, scope: !328, file: !329, line: 174, type: !381)
!384 = !DILocalVariable(name: "rustc", scope: !385, file: !329, line: 175, type: !386, align: 64)
!385 = distinct !DILexicalBlock(scope: !328, file: !329, line: 175, column: 5)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "OsString", scope: !387, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !389, templateParams: !23, identifier: "b6999ab916b206ee756875934c763c0f")
!387 = !DINamespace(name: "os_str", scope: !388)
!388 = !DINamespace(name: "ffi", scope: !17)
!389 = !{!390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !386, file: !2, baseType: !391, size: 192, align: 64, flags: DIFlagPrivate)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "Buf", scope: !392, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !394, templateParams: !23, identifier: "a0fe6e57f6e88c51a75bc2940ba63de0")
!392 = !DINamespace(name: "bytes", scope: !393)
!393 = !DINamespace(name: "os_str", scope: !223)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !391, file: !2, baseType: !345, size: 192, align: 64, flags: DIFlagPublic)
!396 = !DILocalVariable(name: "cmd", scope: !397, file: !329, line: 177, type: !398, align: 64)
!397 = distinct !DILexicalBlock(scope: !385, file: !329, line: 177, column: 5)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "Command", scope: !334, file: !2, size: 1600, align: 64, flags: DIFlagPublic, elements: !399, templateParams: !23, identifier: "9b92fa201d91497a71873f390f7f5b11")
!399 = !{!400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !398, file: !2, baseType: !401, size: 1600, align: 64, flags: DIFlagPrivate)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "Command", scope: !220, file: !2, size: 1600, align: 64, flags: DIFlagPublic, elements: !402, templateParams: !23, identifier: "42cea162ed090243a921d170d6b6b6ee")
!402 = !{!403, !413, !432, !595, !596, !610, !611, !626, !627, !628, !651, !670, !725, !726, !727, !728, !742}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !401, file: !2, baseType: !404, size: 128, align: 64, offset: 1024, flags: DIFlagPrivate)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !405, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !407, templateParams: !23, identifier: "1ac6749c32f91b2d4dc412c933c3901")
!405 = !DINamespace(name: "c_str", scope: !406)
!406 = !DINamespace(name: "ffi", scope: !303)
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !404, file: !2, baseType: !409, size: 128, align: 64, flags: DIFlagPrivate)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !410, templateParams: !23, identifier: "d1b96f7b9a1747fff4089934e76da02")
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !409, file: !2, baseType: !141, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !409, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !401, file: !2, baseType: !414, size: 192, align: 64, flags: DIFlagPrivate)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "CStringArray", scope: !415, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !416, templateParams: !23, identifier: "4621c303089e4dde1d836b46dd46d908")
!415 = !DINamespace(name: "cstring_array", scope: !220)
!416 = !{!417}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ptrs", scope: !414, file: !2, baseType: !418, size: 192, align: 64, flags: DIFlagPrivate)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<*const i8, alloc::alloc::Global>", scope: !346, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !419, templateParams: !430, identifier: "d200829e4d067f15d1c0c7f8eba29d12")
!419 = !{!420, !431}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !418, file: !2, baseType: !421, size: 128, align: 64, flags: DIFlagPrivate)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<*const i8, alloc::alloc::Global>", scope: !302, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !422, templateParams: !430, identifier: "4f3f7f8f3db0e12aee49cc29ba8fd04c")
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !421, file: !2, baseType: !352, size: 128, align: 64, flags: DIFlagPrivate)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !421, file: !2, baseType: !425, align: 8, offset: 128, flags: DIFlagPrivate)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<*const i8>", scope: !51, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !426, identifier: "c76025f9bf48a05b1bafebb8a3e44453")
!426 = !{!427}
!427 = !DITemplateTypeParameter(name: "T", type: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i8", baseType: !429, size: 64, align: 64, dwarfAddressSpace: 0)
!429 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!430 = !{!427, !376}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !418, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !401, file: !2, baseType: !433, size: 256, align: 64, offset: 768, flags: DIFlagPrivate)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "CommandEnv", scope: !434, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !435, templateParams: !23, identifier: "27873f6215130ab16defff71923fc508")
!434 = !DINamespace(name: "env", scope: !222)
!435 = !{!436, !437, !438}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !433, file: !2, baseType: !381, size: 8, align: 8, offset: 192, flags: DIFlagPrivate)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "saw_path", scope: !433, file: !2, baseType: !381, size: 8, align: 8, offset: 200, flags: DIFlagPrivate)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !433, file: !2, baseType: !439, size: 192, align: 64, flags: DIFlagPrivate)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "BTreeMap<std::ffi::os_str::OsString, core::option::Option<std::ffi::os_str::OsString>, alloc::alloc::Global>", scope: !440, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !443, templateParams: !594, identifier: "d9ef13ed5e5af4193edb600147796e04")
!440 = !DINamespace(name: "map", scope: !441)
!441 = !DINamespace(name: "btree", scope: !442)
!442 = !DINamespace(name: "collections", scope: !303)
!443 = !{!444, !578, !579, !585}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !439, file: !2, baseType: !445, size: 128, align: 64, flags: DIFlagPrivate)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::collections::btree::node::NodeRef<alloc::collections::btree::node::marker::Owned, std::ffi::os_str::OsString, core::option::Option<std::ffi::os_str::OsString>, alloc::collections::btree::node::marker::LeafOrInternal>>", scope: !178, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !446, templateParams: !23, identifier: "43816cc75cc3b4f1adff9f2d0b4160bb")
!446 = !{!447}
!447 = !DICompositeType(tag: DW_TAG_variant_part, scope: !445, file: !2, size: 128, align: 64, elements: !448, templateParams: !23, identifier: "ebf1666b6b028ee568e64af9b63d961b", discriminator: !577)
!448 = !{!449, !573}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !447, file: !2, baseType: !450, size: 128, align: 64, extraData: i64 0)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !445, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !451, identifier: "d4d5a8318bb42bc3bcf2c72d348c6018")
!451 = !{!452}
!452 = !DITemplateTypeParameter(name: "T", type: !453)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "NodeRef<alloc::collections::btree::node::marker::Owned, std::ffi::os_str::OsString, core::option::Option<std::ffi::os_str::OsString>, alloc::collections::btree::node::marker::LeafOrInternal>", scope: !454, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !455, templateParams: !570, identifier: "25c992e41637054228c95c47e12eee83")
!454 = !DINamespace(name: "node", scope: !441)
!455 = !{!456, !457, !555}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !453, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !453, file: !2, baseType: !458, size: 64, align: 64, flags: DIFlagPrivate)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::collections::btree::node::LeafNode<std::ffi::os_str::OsString, core::option::Option<std::ffi::os_str::OsString>>>", scope: !42, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !459, templateParams: !553, identifier: "e7de3bc3802f4d82678aca154ae1832c")
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !458, file: !2, baseType: !461, size: 64, align: 64, flags: DIFlagPrivate)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::collections::btree::node::LeafNode<std::ffi::os_str::OsString, core::option::Option<std::ffi::os_str::OsString>>", baseType: !462, size: 64, align: 64, dwarfAddressSpace: 0)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "LeafNode<std::ffi::os_str::OsString, core::option::Option<std::ffi::os_str::OsString>>", scope: !454, file: !2, size: 4352, align: 64, flags: DIFlagPrivate, elements: !463, templateParams: !496, identifier: "fa6e77bc063b9cfd9e3f680ee800bca4")
!463 = !{!464, !519, !530, !531, !542}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !462, file: !2, baseType: !465, size: 64, align: 64, flags: DIFlagPrivate)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::ptr::non_null::NonNull<alloc::collections::btree::node::InternalNode<std::ffi::os_str::OsString, core::option::Option<std::ffi::os_str::OsString>>>>", scope: !178, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !466, templateParams: !23, identifier: "55e79e717fcb3f4df177743a12a54cd")
!466 = !{!467}
!467 = !DICompositeType(tag: DW_TAG_variant_part, scope: !465, file: !2, size: 64, align: 64, elements: !468, templateParams: !23, identifier: "f61bfa6a8e9d02a61fe07bb9f312e9fc", discriminator: !518)
!468 = !{!469, !514}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !467, file: !2, baseType: !470, size: 64, align: 64, extraData: i64 0)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !465, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !471, identifier: "66ba23053b473033c525bd312d60f290")
!471 = !{!472}
!472 = !DITemplateTypeParameter(name: "T", type: !473)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::collections::btree::node::InternalNode<std::ffi::os_str::OsString, core::option::Option<std::ffi::os_str::OsString>>>", scope: !42, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !474, templateParams: !512, identifier: "d40b39e9b1bc981ee96b10e69a990307")
!474 = !{!475}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !473, file: !2, baseType: !476, size: 64, align: 64, flags: DIFlagPrivate)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::collections::btree::node::InternalNode<std::ffi::os_str::OsString, core::option::Option<std::ffi::os_str::OsString>>", baseType: !477, size: 64, align: 64, dwarfAddressSpace: 0)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "InternalNode<std::ffi::os_str::OsString, core::option::Option<std::ffi::os_str::OsString>>", scope: !454, file: !2, size: 5120, align: 64, flags: DIFlagPrivate, elements: !478, templateParams: !496, identifier: "a69d9aa573b0d71c720bcc1e1ebf570a")
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !477, file: !2, baseType: !462, size: 4352, align: 64, flags: DIFlagPrivate)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !477, file: !2, baseType: !481, size: 768, align: 64, offset: 4352, flags: DIFlagPrivate)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 768, align: 64, elements: !494)
!482 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<core::ptr::non_null::NonNull<alloc::collections::btree::node::LeafNode<std::ffi::os_str::OsString, core::option::Option<std::ffi::os_str::OsString>>>>", scope: !483, file: !2, size: 64, align: 64, elements: !485, templateParams: !492, identifier: "964aaaa2bb452cf0d38d901fcae3c8f9")
!483 = !DINamespace(name: "maybe_uninit", scope: !484)
!484 = !DINamespace(name: "mem", scope: !44)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !482, file: !2, baseType: !7, align: 8)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !482, file: !2, baseType: !488, size: 64, align: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<core::ptr::non_null::NonNull<alloc::collections::btree::node::LeafNode<std::ffi::os_str::OsString, core::option::Option<std::ffi::os_str::OsString>>>>", scope: !489, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !490, templateParams: !492, identifier: "ca40b8c004c7b1a7cf28b5f7e5a14ebc")
!489 = !DINamespace(name: "manually_drop", scope: !484)
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !488, file: !2, baseType: !458, size: 64, align: 64, flags: DIFlagPrivate)
!492 = !{!493}
!493 = !DITemplateTypeParameter(name: "T", type: !458)
!494 = !{!495}
!495 = !DISubrange(count: 12, lowerBound: 0)
!496 = !{!497, !498}
!497 = !DITemplateTypeParameter(name: "K", type: !386)
!498 = !DITemplateTypeParameter(name: "V", type: !499)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::ffi::os_str::OsString>", scope: !178, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !500, templateParams: !23, identifier: "ae1fa77092be45e4b5cc6541117786e9")
!500 = !{!501}
!501 = !DICompositeType(tag: DW_TAG_variant_part, scope: !499, file: !2, size: 192, align: 64, elements: !502, templateParams: !23, identifier: "91fb55d70aeaa8b348d2a355aac944ae", discriminator: !511)
!502 = !{!503, !507}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !501, file: !2, baseType: !504, size: 192, align: 64, extraData: i64 -9223372036854775808)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !499, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !505, identifier: "ea22955c72d772c55eb9c19f0a5a464a")
!505 = !{!506}
!506 = !DITemplateTypeParameter(name: "T", type: !386)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !501, file: !2, baseType: !508, size: 192, align: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !499, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !509, templateParams: !505, identifier: "7e9e46ae37740b9fd525a36696377ba3")
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !508, file: !2, baseType: !386, size: 192, align: 64, flags: DIFlagPublic)
!511 = !DIDerivedType(tag: DW_TAG_member, scope: !499, file: !2, baseType: !191, size: 64, align: 64, flags: DIFlagArtificial)
!512 = !{!513}
!513 = !DITemplateTypeParameter(name: "T", type: !477)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !467, file: !2, baseType: !515, size: 64, align: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !465, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !516, templateParams: !471, identifier: "8757853d477c47453b394d6e26c4fa9a")
!516 = !{!517}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !515, file: !2, baseType: !473, size: 64, align: 64, flags: DIFlagPublic)
!518 = !DIDerivedType(tag: DW_TAG_member, scope: !465, file: !2, baseType: !191, size: 64, align: 64, flags: DIFlagArtificial)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "parent_idx", scope: !462, file: !2, baseType: !520, size: 16, align: 16, offset: 4288, flags: DIFlagPrivate)
!520 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<u16>", scope: !483, file: !2, size: 16, align: 16, elements: !521, templateParams: !528, identifier: "6c2cb9239b2948e6ce27168ac404a775")
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !520, file: !2, baseType: !7, align: 8)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !520, file: !2, baseType: !524, size: 16, align: 16)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<u16>", scope: !489, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !525, templateParams: !528, identifier: "184747ec3b5a8288a009700997c1eef2")
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !524, file: !2, baseType: !527, size: 16, align: 16, flags: DIFlagPrivate)
!527 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!528 = !{!529}
!529 = !DITemplateTypeParameter(name: "T", type: !527)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !462, file: !2, baseType: !527, size: 16, align: 16, offset: 4304, flags: DIFlagPrivate)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !462, file: !2, baseType: !532, size: 2112, align: 64, offset: 64, flags: DIFlagPrivate)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 2112, align: 64, elements: !540)
!533 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<std::ffi::os_str::OsString>", scope: !483, file: !2, size: 192, align: 64, elements: !534, templateParams: !505, identifier: "88caca5da0039e34d260353c2ee8f9f7")
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !533, file: !2, baseType: !7, align: 8)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !533, file: !2, baseType: !537, size: 192, align: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<std::ffi::os_str::OsString>", scope: !489, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !538, templateParams: !505, identifier: "728c253001158cb6710fb8a653502688")
!538 = !{!539}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !537, file: !2, baseType: !386, size: 192, align: 64, flags: DIFlagPrivate)
!540 = !{!541}
!541 = !DISubrange(count: 11, lowerBound: 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !462, file: !2, baseType: !543, size: 2112, align: 64, offset: 2176, flags: DIFlagPrivate)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 2112, align: 64, elements: !540)
!544 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<core::option::Option<std::ffi::os_str::OsString>>", scope: !483, file: !2, size: 192, align: 64, elements: !545, templateParams: !551, identifier: "6fe5766c4a6e1aeab09f848ab2baa130")
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !544, file: !2, baseType: !7, align: 8)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !544, file: !2, baseType: !548, size: 192, align: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<core::option::Option<std::ffi::os_str::OsString>>", scope: !489, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !549, templateParams: !551, identifier: "dd756879bc9c01ddcf052fefd076fea")
!549 = !{!550}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !548, file: !2, baseType: !499, size: 192, align: 64, flags: DIFlagPrivate)
!551 = !{!552}
!552 = !DITemplateTypeParameter(name: "T", type: !499)
!553 = !{!554}
!554 = !DITemplateTypeParameter(name: "T", type: !462)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !453, file: !2, baseType: !556, align: 8, offset: 128, flags: DIFlagPrivate)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::collections::btree::node::marker::Owned, alloc::collections::btree::node::marker::LeafOrInternal)>", scope: !51, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !557, identifier: "e42ba2e6309cadc56f53ec775f33856c")
!557 = !{!558}
!558 = !DITemplateTypeParameter(name: "T", type: !559)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::collections::btree::node::marker::Owned, alloc::collections::btree::node::marker::LeafOrInternal)", file: !2, align: 8, elements: !560, templateParams: !23, identifier: "42c7030c3eabcda814b7c6cd689c9696")
!560 = !{!561, !566}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !559, file: !2, baseType: !562, align: 8)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "Owned", scope: !563, file: !2, align: 8, flags: DIFlagProtected, elements: !564, templateParams: !23, identifier: "f6285c9bd79507d26630f49451ebe3ac")
!563 = !DINamespace(name: "marker", scope: !454)
!564 = !{!565}
!565 = !DICompositeType(tag: DW_TAG_variant_part, scope: !562, file: !2, align: 8, elements: !23, identifier: "30c24e147a3ed25d21cfde31fe2aa26f")
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !559, file: !2, baseType: !567, align: 8)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "LeafOrInternal", scope: !563, file: !2, align: 8, flags: DIFlagProtected, elements: !568, templateParams: !23, identifier: "b998c9511a6fa28a592bc4896f5e4a6")
!568 = !{!569}
!569 = !DICompositeType(tag: DW_TAG_variant_part, scope: !567, file: !2, align: 8, elements: !23, identifier: "f860c769f60a9c1973f8e4c9bd9d03f3")
!570 = !{!571, !497, !498, !572}
!571 = !DITemplateTypeParameter(name: "BorrowType", type: !562)
!572 = !DITemplateTypeParameter(name: "Type", type: !567)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !447, file: !2, baseType: !574, size: 128, align: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !445, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !575, templateParams: !451, identifier: "df69f7c09cf2d5fc442bb5157ef3ec81")
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !574, file: !2, baseType: !453, size: 128, align: 64, flags: DIFlagPublic)
!577 = !DIDerivedType(tag: DW_TAG_member, scope: !445, file: !2, baseType: !191, size: 64, align: 64, flags: DIFlagArtificial)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !439, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !439, file: !2, baseType: !580, align: 8, offset: 192, flags: DIFlagProtected)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<alloc::alloc::Global>", scope: !489, file: !2, align: 8, flags: DIFlagPublic, elements: !581, templateParams: !583, identifier: "d4a3aa127d3d62a4a00b078483f66035")
!581 = !{!582}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !580, file: !2, baseType: !373, align: 8, flags: DIFlagPrivate)
!583 = !{!584}
!584 = !DITemplateTypeParameter(name: "T", type: !373)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !439, file: !2, baseType: !586, align: 8, offset: 192, flags: DIFlagPrivate)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::boxed::Box<(std::ffi::os_str::OsString, core::option::Option<std::ffi::os_str::OsString>), alloc::alloc::Global>>", scope: !51, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !587, identifier: "6d6a96bb4e04548634804a1f749bff35")
!587 = !{!588}
!588 = !DITemplateTypeParameter(name: "T", type: !589)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<(std::ffi::os_str::OsString, core::option::Option<std::ffi::os_str::OsString>), alloc::alloc::Global>", baseType: !590, size: 64, align: 64, dwarfAddressSpace: 0)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "(std::ffi::os_str::OsString, core::option::Option<std::ffi::os_str::OsString>)", file: !2, size: 384, align: 64, elements: !591, templateParams: !23, identifier: "80e7daeecae61b0ed2ad09fbed688e22")
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !590, file: !2, baseType: !386, size: 192, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !590, file: !2, baseType: !499, size: 192, align: 64, offset: 192)
!594 = !{!497, !498, !376}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "program_kind", scope: !401, file: !2, baseType: !219, size: 8, align: 8, offset: 1560, flags: DIFlagPrivate)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "cwd", scope: !401, file: !2, baseType: !597, size: 128, align: 64, offset: 1152, flags: DIFlagPrivate)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::ffi::c_str::CString>", scope: !178, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !598, templateParams: !23, identifier: "865b89534c4612553ff01b58c863c2e6")
!598 = !{!599}
!599 = !DICompositeType(tag: DW_TAG_variant_part, scope: !597, file: !2, size: 128, align: 64, elements: !600, templateParams: !23, identifier: "4fb418135862235a2de23b510031420d", discriminator: !609)
!600 = !{!601, !605}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !599, file: !2, baseType: !602, size: 128, align: 64, extraData: i64 0)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !597, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !603, identifier: "622440c39c1df61f506b6e040c55268")
!603 = !{!604}
!604 = !DITemplateTypeParameter(name: "T", type: !404)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !599, file: !2, baseType: !606, size: 128, align: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !597, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !607, templateParams: !603, identifier: "75a8dff9a1eedc459fdcaceb6c67c13")
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !606, file: !2, baseType: !404, size: 128, align: 64, flags: DIFlagPublic)
!609 = !DIDerivedType(tag: DW_TAG_member, scope: !597, file: !2, baseType: !191, size: 64, align: 64, flags: DIFlagArtificial)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "chroot", scope: !401, file: !2, baseType: !597, size: 128, align: 64, offset: 1280, flags: DIFlagPrivate)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !401, file: !2, baseType: !612, size: 64, align: 32, offset: 384, flags: DIFlagPrivate)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u32>", scope: !178, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !613, templateParams: !23, identifier: "2cd42c7e128d7ca14f939caaf652196b")
!613 = !{!614}
!614 = !DICompositeType(tag: DW_TAG_variant_part, scope: !612, file: !2, size: 64, align: 32, elements: !615, templateParams: !23, identifier: "aef93d390c2230084b813b4b40bb6c2f", discriminator: !625)
!615 = !{!616, !621}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !614, file: !2, baseType: !617, size: 64, align: 32, extraData: i32 0)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !612, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !23, templateParams: !618, identifier: "4aeebdb486bd485924770104c7397a0c")
!618 = !{!619}
!619 = !DITemplateTypeParameter(name: "T", type: !620)
!620 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !614, file: !2, baseType: !622, size: 64, align: 32, extraData: i32 1)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !612, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !623, templateParams: !618, identifier: "b5ad95f77e9914975f7cf2c1f60a3bf5")
!623 = !{!624}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !622, file: !2, baseType: !620, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!625 = !DIDerivedType(tag: DW_TAG_member, scope: !612, file: !2, baseType: !620, size: 32, align: 32, flags: DIFlagArtificial)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !401, file: !2, baseType: !612, size: 64, align: 32, offset: 448, flags: DIFlagPrivate)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "saw_nul", scope: !401, file: !2, baseType: !381, size: 8, align: 8, offset: 1536, flags: DIFlagPrivate)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "closures", scope: !401, file: !2, baseType: !629, size: 192, align: 64, offset: 192, flags: DIFlagPrivate)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<alloc::boxed::Box<(dyn core::ops::function::FnMut<(), Output=core::result::Result<(), std::io::error::Error>> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>, alloc::alloc::Global>", scope: !346, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !630, templateParams: !649, identifier: "57d96fbc3aeb94e352c514f469157e6")
!630 = !{!631, !650}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !629, file: !2, baseType: !632, size: 128, align: 64, flags: DIFlagPrivate)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<alloc::boxed::Box<(dyn core::ops::function::FnMut<(), Output=core::result::Result<(), std::io::error::Error>> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>, alloc::alloc::Global>", scope: !302, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !633, templateParams: !649, identifier: "1a4b85747eabda50eb05c338e119678a")
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !632, file: !2, baseType: !352, size: 128, align: 64, flags: DIFlagPrivate)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !632, file: !2, baseType: !636, align: 8, offset: 128, flags: DIFlagPrivate)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::boxed::Box<(dyn core::ops::function::FnMut<(), Output=core::result::Result<(), std::io::error::Error>> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>", scope: !51, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !637, identifier: "391831481b7000f4796a49f54c8cb2bd")
!637 = !{!638}
!638 = !DITemplateTypeParameter(name: "T", type: !639)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::ops::function::FnMut<(), Output=core::result::Result<(), std::io::error::Error>> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !640, templateParams: !23, identifier: "86215292af4a28573e4b7d792e9ba682")
!640 = !{!641, !644}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !639, file: !2, baseType: !642, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64, dwarfAddressSpace: 0)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::ops::function::FnMut<(), Output=core::result::Result<(), std::io::error::Error>> + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !23, identifier: "b79d381e8710118b65484609d414ba55")
!644 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !639, file: !2, baseType: !645, size: 64, align: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 5]", baseType: !646, size: 64, align: 64, dwarfAddressSpace: 0)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 320, align: 64, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 5, lowerBound: 0)
!649 = !{!638, !376}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !629, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !401, file: !2, baseType: !652, size: 128, align: 64, offset: 1408, flags: DIFlagPrivate)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::boxed::Box<[u32], alloc::alloc::Global>>", scope: !178, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !653, templateParams: !23, identifier: "b24b8fb36ecd5e34a1dc6b3f396ad9ae")
!653 = !{!654}
!654 = !DICompositeType(tag: DW_TAG_variant_part, scope: !652, file: !2, size: 128, align: 64, elements: !655, templateParams: !23, identifier: "77fe5093d26466035f445a8fde76148c", discriminator: !669)
!655 = !{!656, !665}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !654, file: !2, baseType: !657, size: 128, align: 64, extraData: i64 0)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !652, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !658, identifier: "b46096e3f6109307ffeca4a380a3ceea")
!658 = !{!659}
!659 = !DITemplateTypeParameter(name: "T", type: !660)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u32], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !661, templateParams: !23, identifier: "e60d1341ac3cc9feeb71755525ff199d")
!661 = !{!662, !664}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !660, file: !2, baseType: !663, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64, align: 64, dwarfAddressSpace: 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !660, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !654, file: !2, baseType: !666, size: 128, align: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !652, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !667, templateParams: !658, identifier: "e0530e8385e77ac9d39313062f9a3f92")
!667 = !{!668}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !666, file: !2, baseType: !660, size: 128, align: 64, flags: DIFlagPublic)
!669 = !DIDerivedType(tag: DW_TAG_member, scope: !652, file: !2, baseType: !191, size: 64, align: 64, flags: DIFlagArtificial)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "stdin", scope: !401, file: !2, baseType: !671, size: 64, align: 32, offset: 576, flags: DIFlagPrivate)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::sys::process::unix::common::Stdio>", scope: !178, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !672, templateParams: !23, identifier: "10b2c7d8b2dde3a9e808c78b4085c80")
!672 = !{!673}
!673 = !DICompositeType(tag: DW_TAG_variant_part, scope: !671, file: !2, size: 64, align: 32, elements: !674, templateParams: !23, identifier: "127dd76df7ed5e08f29d77f217e8b8ad", discriminator: !724)
!674 = !{!675, !720}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !673, file: !2, baseType: !676, size: 64, align: 32, extraData: i32 5)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !671, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !23, templateParams: !677, identifier: "c0e5076029103824c096976c65039e48")
!677 = !{!678}
!678 = !DITemplateTypeParameter(name: "T", type: !679)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stdio", scope: !220, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !680, templateParams: !23, identifier: "1971c24881da0299272d0c86c56be480")
!680 = !{!681}
!681 = !DICompositeType(tag: DW_TAG_variant_part, scope: !679, file: !2, size: 64, align: 32, elements: !682, templateParams: !23, identifier: "85252269a9384f605ae4617fee07cf7f", discriminator: !719)
!682 = !{!683, !685, !687, !689, !707}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Inherit", scope: !681, file: !2, baseType: !684, size: 64, align: 32, extraData: i32 0)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inherit", scope: !679, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !23, identifier: "21a82bc11a9d0373977e182cba12c170")
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Null", scope: !681, file: !2, baseType: !686, size: 64, align: 32, extraData: i32 1)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "Null", scope: !679, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !23, identifier: "f127e731a6f3624bd2cf6eccc4aad6c5")
!687 = !DIDerivedType(tag: DW_TAG_member, name: "MakePipe", scope: !681, file: !2, baseType: !688, size: 64, align: 32, extraData: i32 2)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "MakePipe", scope: !679, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !23, identifier: "8d39ac45d2877abcb4c7df18b62b7e02")
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Fd", scope: !681, file: !2, baseType: !690, size: 64, align: 32, extraData: i32 3)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fd", scope: !679, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !691, templateParams: !23, identifier: "22c938a1c2e124515344755e13ae5405")
!691 = !{!692}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !690, file: !2, baseType: !693, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDesc", scope: !694, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !696, templateParams: !23, identifier: "d0f0240acd1660f85db9997f8734b7ab")
!694 = !DINamespace(name: "unix", scope: !695)
!695 = !DINamespace(name: "fd", scope: !223)
!696 = !{!697}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !693, file: !2, baseType: !698, size: 32, align: 32, flags: DIFlagPrivate)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "OwnedFd", scope: !699, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !702, templateParams: !23, identifier: "978f0bd435457864ea7ae72198744216")
!699 = !DINamespace(name: "owned", scope: !700)
!700 = !DINamespace(name: "fd", scope: !701)
!701 = !DINamespace(name: "os", scope: !17)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !698, file: !2, baseType: !704, size: 32, align: 32, flags: DIFlagPrivate)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "I32NotAllOnes", scope: !369, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !705, templateParams: !23, identifier: "9b5532256668b17ba149065be7b489d0")
!705 = !{!706}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !704, file: !2, baseType: !62, size: 32, align: 32, flags: DIFlagPrivate)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "StaticFd", scope: !681, file: !2, baseType: !708, size: 64, align: 32, extraData: i32 4)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "StaticFd", scope: !679, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !709, templateParams: !23, identifier: "657b53572983151c7f0cbbb101d3e063")
!709 = !{!710}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !708, file: !2, baseType: !711, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorrowedFd", scope: !699, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !712, templateParams: !23, identifier: "49d20f64ef43901e71efe08cb659302b")
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !711, file: !2, baseType: !704, size: 32, align: 32, flags: DIFlagPrivate)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_phantom", scope: !711, file: !2, baseType: !715, align: 8, offset: 32, flags: DIFlagPrivate)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&std::os::fd::owned::OwnedFd>", scope: !51, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !716, identifier: "9582c5650237d6484b695124b7bed8a8")
!716 = !{!717}
!717 = !DITemplateTypeParameter(name: "T", type: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::os::fd::owned::OwnedFd", baseType: !698, size: 64, align: 64, dwarfAddressSpace: 0)
!719 = !DIDerivedType(tag: DW_TAG_member, scope: !679, file: !2, baseType: !620, size: 32, align: 32, flags: DIFlagArtificial)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !673, file: !2, baseType: !721, size: 64, align: 32)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !671, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !722, templateParams: !677, identifier: "e4dca513b4ec1daa4c6b7e15780f6af7")
!722 = !{!723}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !721, file: !2, baseType: !679, size: 64, align: 32, flags: DIFlagPublic)
!724 = !DIDerivedType(tag: DW_TAG_member, scope: !671, file: !2, baseType: !620, size: 32, align: 32, flags: DIFlagArtificial)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "stdout", scope: !401, file: !2, baseType: !671, size: 64, align: 32, offset: 640, flags: DIFlagPrivate)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "stderr", scope: !401, file: !2, baseType: !671, size: 64, align: 32, offset: 704, flags: DIFlagPrivate)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "create_pidfd", scope: !401, file: !2, baseType: !381, size: 8, align: 8, offset: 1544, flags: DIFlagPrivate)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pgroup", scope: !401, file: !2, baseType: !729, size: 64, align: 32, offset: 512, flags: DIFlagPrivate)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<i32>", scope: !178, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !730, templateParams: !23, identifier: "3b8de33d486976922b24a28fbce45b59")
!730 = !{!731}
!731 = !DICompositeType(tag: DW_TAG_variant_part, scope: !729, file: !2, size: 64, align: 32, elements: !732, templateParams: !23, identifier: "69547e9e1a9c15c2e651ef91ca5d3da8", discriminator: !741)
!732 = !{!733, !737}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !731, file: !2, baseType: !734, size: 64, align: 32, extraData: i32 0)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !729, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !23, templateParams: !735, identifier: "da5afc7156c4c30967a641d32bbd573")
!735 = !{!736}
!736 = !DITemplateTypeParameter(name: "T", type: !62)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !731, file: !2, baseType: !738, size: 64, align: 32, extraData: i32 1)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !729, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !739, templateParams: !735, identifier: "cc39260536245e0eb94e8a6b46e80d85")
!739 = !{!740}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !738, file: !2, baseType: !62, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!741 = !DIDerivedType(tag: DW_TAG_member, scope: !729, file: !2, baseType: !620, size: 32, align: 32, flags: DIFlagArtificial)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "setsid", scope: !401, file: !2, baseType: !381, size: 8, align: 8, offset: 1552, flags: DIFlagPrivate)
!743 = !DILocalVariable(name: "wrapper", scope: !744, file: !329, line: 178, type: !745, align: 64)
!744 = distinct !DILexicalBlock(scope: !385, file: !329, line: 178, column: 9)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::ffi::os_str::OsString", baseType: !386, size: 64, align: 64, dwarfAddressSpace: 0)
!746 = !DILocalVariable(name: "wrapper", scope: !744, file: !329, line: 178, type: !747, align: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&std::ffi::os_str::OsString", baseType: !745, size: 64, align: 64, dwarfAddressSpace: 0)
!748 = !DILocalVariable(name: "wrapper", scope: !749, file: !329, line: 179, type: !386, align: 64)
!749 = distinct !DILexicalBlock(scope: !385, file: !329, line: 179, column: 9)
!750 = !DILocalVariable(name: "cmd", scope: !751, file: !329, line: 180, type: !398, align: 64)
!751 = distinct !DILexicalBlock(scope: !749, file: !329, line: 180, column: 13)
!752 = !DILocalVariable(name: "output", scope: !753, file: !329, line: 193, type: !333, align: 64)
!753 = distinct !DILexicalBlock(scope: !397, file: !329, line: 193, column: 5)
!754 = !DILocalVariable(name: "args", scope: !755, file: !329, line: 195, type: !758, align: 64)
!755 = !DILexicalBlockFile(scope: !756, file: !329, discriminator: 0)
!756 = distinct !DILexicalBlock(scope: !753, file: !757, line: 62, column: 38)
!757 = !DIFile(filename: "/rustc/f8297e351a40c1439a467bbbb6879088047f50b3/library/core/src/panic.rs", directory: "", checksumkind: CSK_MD5, checksum: "af6d9dd47250bbbd0daf63956ba674ac")
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 128, align: 64, elements: !822)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !760, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !762, templateParams: !23, identifier: "a64ebb2da98ad8cd523bf22d581450a0")
!760 = !DINamespace(name: "rt", scope: !761)
!761 = !DINamespace(name: "fmt", scope: !44)
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !759, file: !2, baseType: !764, size: 128, align: 64, flags: DIFlagPrivate)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !760, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !765, templateParams: !23, identifier: "a0986c1d8c42330c2ccb6994238d036")
!765 = !{!766}
!766 = !DICompositeType(tag: DW_TAG_variant_part, scope: !764, file: !2, size: 128, align: 64, elements: !767, templateParams: !23, identifier: "4cce771e46b015aa294ea53675c7967", discriminator: !821)
!767 = !{!768, !817}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !766, file: !2, baseType: !769, size: 128, align: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !764, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !770, templateParams: !23, identifier: "32096f5d360ce82abef8f28a1c366c8e")
!770 = !{!771, !772, !813}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !769, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagPrivate)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !769, file: !2, baseType: !773, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(core::ptr::non_null::NonNull<()>, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !774, size: 64, align: 64, dwarfAddressSpace: 0)
!774 = !DISubroutineType(types: !775)
!775 = !{!776, !41, !793}
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !777, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !778, templateParams: !23, identifier: "cc621153baa62273e1d5317cd8c95256")
!777 = !DINamespace(name: "result", scope: !44)
!778 = !{!779}
!779 = !DICompositeType(tag: DW_TAG_variant_part, scope: !776, file: !2, size: 8, align: 8, elements: !780, templateParams: !23, identifier: "97f70f95c44c3df549ad0d94d230cef4", discriminator: !792)
!780 = !{!781, !788}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !779, file: !2, baseType: !782, size: 8, align: 8, extraData: i8 0)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !776, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !783, templateParams: !785, identifier: "ec2f8aa08737d6854b25f87e36015000")
!783 = !{!784}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !782, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!785 = !{!48, !786}
!786 = !DITemplateTypeParameter(name: "E", type: !787)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !761, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "4e10c97380bc1052e26842e514c07b58")
!788 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !779, file: !2, baseType: !789, size: 8, align: 8, extraData: i8 1)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !776, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !790, templateParams: !785, identifier: "5836f172dd113fa0e1839c449d1255a")
!790 = !{!791}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !789, file: !2, baseType: !787, align: 8, offset: 8, flags: DIFlagPublic)
!792 = !DIDerivedType(tag: DW_TAG_member, scope: !776, file: !2, baseType: !70, size: 8, align: 8, flags: DIFlagArtificial)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !794, size: 64, align: 64, dwarfAddressSpace: 0)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !761, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !795, templateParams: !23, identifier: "94e132869bcec4069af040a17a417dc7")
!795 = !{!796, !802}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !794, file: !2, baseType: !797, size: 64, align: 32, offset: 128, flags: DIFlagPrivate)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormattingOptions", scope: !761, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !798, templateParams: !23, identifier: "693054fe9da7b65cbaf8d4db1884220d")
!798 = !{!799, !800, !801}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !797, file: !2, baseType: !620, size: 32, align: 32, flags: DIFlagPrivate)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !797, file: !2, baseType: !527, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !797, file: !2, baseType: !527, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !794, file: !2, baseType: !803, size: 128, align: 64, flags: DIFlagPrivate)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !804, templateParams: !23, identifier: "104810609c399af05a756c8a6780b67e")
!804 = !{!805, !808}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !803, file: !2, baseType: !806, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64, align: 64, dwarfAddressSpace: 0)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "a14cb6e521f593dff04dad945921eaa8")
!808 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !803, file: !2, baseType: !809, size: 64, align: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !810, size: 64, align: 64, dwarfAddressSpace: 0)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 384, align: 64, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 6, lowerBound: 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_lifetime", scope: !769, file: !2, baseType: !814, align: 8, offset: 128, flags: DIFlagPrivate)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&()>", scope: !51, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !815, identifier: "3353c2e93b9170d7bdb4cbe585bbf9b1")
!815 = !{!816}
!816 = !DITemplateTypeParameter(name: "T", type: !327)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !766, file: !2, baseType: !818, size: 128, align: 64, extraData: i64 0)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !764, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !819, templateParams: !23, identifier: "b3336e3ef853d0e4f5e2fa7ee806da5b")
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !818, file: !2, baseType: !527, size: 16, align: 16, offset: 64, flags: DIFlagPrivate)
!821 = !DIDerivedType(tag: DW_TAG_member, scope: !764, file: !2, baseType: !191, size: 64, align: 64, flags: DIFlagArtificial)
!822 = !{!823}
!823 = !DISubrange(count: 1, lowerBound: 0)
!824 = !DILocation(line: 0, scope: !744)
!825 = !DILocation(line: 0, scope: !328)
!826 = !DILocalVariable(name: "self", arg: 1, scope: !827, file: !828, line: 962, type: !499)
!827 = distinct !DISubprogram(name: "expect<std::ffi::os_str::OsString>", linkageName: "_ZN4core6option15Option$LT$T$GT$6expect17h939b350fc9136091E", scope: !499, file: !828, line: 962, type: !829, scopeLine: 962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !216, templateParams: !505, declaration: !848, retainedNodes: !849)
!828 = !DIFile(filename: "/rustc/f8297e351a40c1439a467bbbb6879088047f50b3/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "e7686a7bf306734f1a5d8a832cef9d9c")
!829 = !DISubroutineType(types: !830)
!830 = !{!386, !499, !138, !831}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !832, size: 64, align: 64, dwarfAddressSpace: 0)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !833, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !835, templateParams: !23, identifier: "a480c92025f0d039d76b5f0e2cdba1fe")
!833 = !DINamespace(name: "location", scope: !834)
!834 = !DINamespace(name: "panic", scope: !44)
!835 = !{!836, !844, !845, !846}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !832, file: !2, baseType: !837, size: 128, align: 64, flags: DIFlagPrivate)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<str>", scope: !42, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !838, templateParams: !363, identifier: "f8e4a7c3a4ad9a149e0a7a5b915fc17e")
!838 = !{!839}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !837, file: !2, baseType: !840, size: 128, align: 64, flags: DIFlagPrivate)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const str", file: !2, size: 128, align: 64, elements: !841, templateParams: !23, identifier: "238a44609877474087c05adf26cd41fa")
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !840, file: !2, baseType: !141, size: 64, align: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !840, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !832, file: !2, baseType: !620, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !832, file: !2, baseType: !620, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_filename", scope: !832, file: !2, baseType: !847, align: 8, offset: 192, flags: DIFlagPrivate)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&str>", scope: !51, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !184, identifier: "4a26c7d33a2a4fbe56277e04d585c2ec")
!848 = !DISubprogram(name: "expect<std::ffi::os_str::OsString>", linkageName: "_ZN4core6option15Option$LT$T$GT$6expect17h939b350fc9136091E", scope: !499, file: !828, line: 962, type: !829, scopeLine: 962, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !505)
!849 = !{!826, !850, !851}
!850 = !DILocalVariable(name: "msg", scope: !827, file: !828, line: 962, type: !138, align: 64)
!851 = !DILocalVariable(name: "val", scope: !852, file: !828, line: 964, type: !386, align: 64)
!852 = distinct !DILexicalBlock(scope: !827, file: !828, line: 964, column: 13)
!853 = !DILocation(line: 962, column: 25, scope: !827, inlinedAt: !854)
!854 = !DILocation(line: 175, column: 38, scope: !328)
!855 = !DILocation(line: 177, column: 9, scope: !397)
!856 = !DILocation(line: 180, column: 17, scope: !751)
!857 = !DILocation(line: 193, column: 9, scope: !753)
!858 = !DILocation(line: 195, column: 5, scope: !755)
!859 = !DILocation(line: 0, scope: !827, inlinedAt: !854)
!860 = !DILocalVariable(name: "_index", scope: !861, file: !862, line: 656, type: !877, align: 8)
!861 = distinct !DISubprogram(name: "index", linkageName: "_ZN105_$LT$std..ffi..os_str..OsString$u20$as$u20$core..ops..index..Index$LT$core..ops..range..RangeFull$GT$$GT$5index17ha709cbeed371ce3bE", scope: !863, file: !862, line: 656, type: !864, scopeLine: 656, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !216, templateParams: !23, retainedNodes: !880)
!862 = !DIFile(filename: "/rustc/f8297e351a40c1439a467bbbb6879088047f50b3/library/std/src/ffi/os_str.rs", directory: "", checksumkind: CSK_MD5, checksum: "69a74a2775e613a2e0d83109b602a162")
!863 = !DINamespace(name: "{impl#5}", scope: !387)
!864 = !DISubroutineType(types: !865)
!865 = !{!866, !745, !877, !831}
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "&std::ffi::os_str::OsStr", file: !2, size: 128, align: 64, elements: !867, templateParams: !23, identifier: "79e0e2c0d4271ce5b3455cf0bba33d21")
!867 = !{!868, !876}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !866, file: !2, baseType: !869, size: 64, align: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64, align: 64, dwarfAddressSpace: 0)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "OsStr", scope: !387, file: !2, align: 8, flags: DIFlagPublic, elements: !871, templateParams: !23, identifier: "5154f08aee687ba89db24be1ea9e8a1d")
!871 = !{!872}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !870, file: !2, baseType: !873, align: 8, flags: DIFlagPrivate)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "Slice", scope: !392, file: !2, align: 8, flags: DIFlagPublic, elements: !874, templateParams: !23, identifier: "ccfd121fa885ee49e7e507ea72630378")
!874 = !{!875}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !873, file: !2, baseType: !70, align: 8, flags: DIFlagPublic)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !866, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFull", scope: !878, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "3631f35db3dfea179839db8b3104ec78")
!878 = !DINamespace(name: "range", scope: !879)
!879 = !DINamespace(name: "ops", scope: !44)
!880 = !{!881, !860}
!881 = !DILocalVariable(name: "self", arg: 1, scope: !861, file: !862, line: 656, type: !745)
!882 = !DILocation(line: 656, column: 21, scope: !861, inlinedAt: !883)
!883 = !DILocation(line: 675, column: 14, scope: !884, inlinedAt: !890)
!884 = distinct !DISubprogram(name: "deref", linkageName: "_ZN70_$LT$std..ffi..os_str..OsString$u20$as$u20$core..ops..deref..Deref$GT$5deref17h767236bed40b6d41E", scope: !885, file: !862, line: 674, type: !886, scopeLine: 674, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !216, templateParams: !23, retainedNodes: !888)
!885 = !DINamespace(name: "{impl#7}", scope: !387)
!886 = !DISubroutineType(types: !887)
!887 = !{!866, !745}
!888 = !{!889}
