; ModuleID = 'build_script_build.829a1aa83ee2f87c-cgu.0'
source_filename = "build_script_build.829a1aa83ee2f87c-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"alloc::sync::Arc<std::path::Path>" = type { %"core::ptr::non_null::NonNull<alloc::sync::ArcInner<std::path::Path>>", %"core::marker::PhantomData<alloc::sync::ArcInner<std::path::Path>>", %"alloc::alloc::Global" }
%"core::ptr::non_null::NonNull<alloc::sync::ArcInner<std::path::Path>>" = type { { ptr, i64 } }
%"core::marker::PhantomData<alloc::sync::ArcInner<std::path::Path>>" = type {}
%"alloc::alloc::Global" = type {}
%"alloc::sync::Arc<str>" = type { %"core::ptr::non_null::NonNull<alloc::sync::ArcInner<str>>", %"core::marker::PhantomData<alloc::sync::ArcInner<str>>", %"alloc::alloc::Global" }
%"core::ptr::non_null::NonNull<alloc::sync::ArcInner<str>>" = type { { ptr, i64 } }
%"core::marker::PhantomData<alloc::sync::ArcInner<str>>" = type {}
%"core::option::Option<alloc::sync::Arc<str>>" = type { ptr, [1 x i64] }
%"alloc::sync::Arc<std::ffi::os_str::OsStr>" = type { %"core::ptr::non_null::NonNull<alloc::sync::ArcInner<std::ffi::os_str::OsStr>>", %"core::marker::PhantomData<alloc::sync::ArcInner<std::ffi::os_str::OsStr>>", %"alloc::alloc::Global" }
%"core::ptr::non_null::NonNull<alloc::sync::ArcInner<std::ffi::os_str::OsStr>>" = type { { ptr, i64 } }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "47ca48354a1eae17c7180e4e001a6ff")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "6d9a64dc1e997260cfd7fe3b035f14f8")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !{i32 8, !"PIC Level", i32 2}
!25 = !{i32 7, !"PIE Level", i32 2}
!26 = !{i32 2, !"RtLibUseGOT", i32 1}
!27 = !{i32 7, !"Dwarf Version", i32 4}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{!"rustc version 1.91.0 (f8297e351 2025-10-28)"}
!30 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !31, producer: "clang LLVM (rustc version 1.91.0 (f8297e351 2025-10-28))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !32, globals: !138, splitDebugInlining: false, nameTableKind: None)
!31 = !DIFile(filename: "build.rs/@/build_script_build.829a1aa83ee2f87c-cgu.0", directory: "/users/ddavis65/rust-ffi-test")
!32 = !{!33, !41, !53, !123, !129}
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputKind", scope: !34, file: !2, baseType: !36, size: 8, align: 8, flags: DIFlagEnumClass, elements: !37)
!34 = !DINamespace(name: "command_helpers", scope: !35)
!35 = !DINamespace(name: "cc", scope: null)
!36 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!37 = !{!38, !39, !40}
!38 = !DIEnumerator(name: "Forward", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "Discard", value: 1, isUnsigned: true)
!40 = !DIEnumerator(name: "Capture", value: 2, isUnsigned: true)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !35, file: !2, baseType: !36, size: 8, align: 8, flags: DIFlagEnumClass, elements: !42)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!43 = !DIEnumerator(name: "IOError", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "EnvVarNotFound", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "ToolExecError", value: 2, isUnsigned: true)
!46 = !DIEnumerator(name: "ToolNotFound", value: 3, isUnsigned: true)
!47 = !DIEnumerator(name: "InvalidArgument", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "ToolFamilyMacroNotFound", value: 5, isUnsigned: true)
!49 = !DIEnumerator(name: "InvalidTarget", value: 6, isUnsigned: true)
!50 = !DIEnumerator(name: "UnknownTarget", value: 7, isUnsigned: true)
!51 = !DIEnumerator(name: "InvalidFlag", value: 8, isUnsigned: true)
!52 = !DIEnumerator(name: "Disabled", value: 9, isUnsigned: true)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !54, file: !2, baseType: !57, size: 64, align: 64, flags: DIFlagEnumClass, elements: !58)
!54 = !DINamespace(name: "alignment", scope: !55)
!55 = !DINamespace(name: "ptr", scope: !56)
!56 = !DINamespace(name: "core", scope: null)
!57 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!59 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!63 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!64 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!65 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!66 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!67 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!68 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!69 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!70 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!71 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!72 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!73 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!74 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!75 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!76 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!77 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!78 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!79 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!80 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!81 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!82 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!83 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!84 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!85 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!86 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!87 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!88 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!89 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!90 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!91 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!92 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!93 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!94 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!95 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!96 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!97 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!98 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!99 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!100 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!101 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!102 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!103 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!104 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!105 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!106 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!107 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!108 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!109 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!110 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!111 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!112 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!113 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!114 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!115 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!116 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!117 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!118 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!119 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!120 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!121 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!122 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !124, file: !2, baseType: !36, size: 8, align: 8, flags: DIFlagEnumClass, elements: !125)
!124 = !DINamespace(name: "panicking", scope: !56)
!125 = !{!126, !127, !128}
!126 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!127 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!128 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !130, file: !2, baseType: !36, size: 8, align: 8, flags: DIFlagEnumClass, elements: !132)
!130 = !DINamespace(name: "atomic", scope: !131)
!131 = !DINamespace(name: "sync", scope: !56)
!132 = !{!133, !134, !135, !136, !137}
!133 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!134 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!135 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!136 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!137 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!138 = !{!0, !139}
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "<core::alloc::layout::LayoutError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !141, isLocal: true, isDefinition: true)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::alloc::layout::LayoutError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !142, vtableHolder: !147, templateParams: !23, identifier: "f6ccac86669078b47b7be45bba706cea")
!142 = !{!143, !144, !145, !146}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !141, file: !2, baseType: !6, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !141, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !141, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !141, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "LayoutError", scope: !148, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "28c229f3433a9d915d5bc25d47d5a1a6")
!148 = !DINamespace(name: "layout", scope: !149)
!149 = !DINamespace(name: "alloc", scope: !56)
!150 = distinct !DISubprogram(name: "main", linkageName: "_ZN18build_script_build4main17h1027e6978416fe3eE", scope: !152, file: !151, line: 2, type: !21, scopeLine: 2, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized | DISPFlagMainSubprogram, unit: !30, templateParams: !23)
!151 = !DIFile(filename: "build.rs", directory: "/users/ddavis65/rust-ffi-test", checksumkind: CSK_MD5, checksum: "5e7e8914bb4b98fabe44f23026604b60")
!152 = !DINamespace(name: "build_script_build", scope: null)
!153 = !DILocalVariable(name: "pieces", scope: !154, file: !155, line: 194, type: !291, align: 64)
!154 = distinct !DISubprogram(name: "new_const<1>", linkageName: "_ZN4core3fmt2rt38_$LT$impl$u20$core..fmt..Arguments$GT$9new_const17h15464fc7eebfa43bE", scope: !156, file: !155, line: 194, type: !289, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !30, templateParams: !23, declaration: !295, retainedNodes: !296)
!155 = !DIFile(filename: "/rustc/f8297e351a40c1439a467bbbb6879088047f50b3/library/core/src/fmt/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "03cba3c9b7eca44212bc16adf1d5b1bc")
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !157, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !158, templateParams: !23, identifier: "3e14e6e534bc9c56f5fa95bdb9db37b9")
!157 = !DINamespace(name: "fmt", scope: !56)
!158 = !{!159, !170, !214}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !156, file: !2, baseType: !160, size: 128, align: 64, flags: DIFlagPrivate)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !161, templateParams: !23, identifier: "4e66b00a376d6af5b8765440fb2839f")
!161 = !{!162, !169}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !160, file: !2, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64, dwarfAddressSpace: 0)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !165, templateParams: !23, identifier: "9277eecd40495f85161460476aacc992")
!165 = !{!166, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !164, file: !2, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !164, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !160, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !156, file: !2, baseType: !171, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !172, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !173, templateParams: !23, identifier: "f4128f4a1478b8d4e97c2666c541d44c")
!172 = !DINamespace(name: "option", scope: !56)
!173 = !{!174}
!174 = !DICompositeType(tag: DW_TAG_variant_part, scope: !171, file: !2, size: 128, align: 64, elements: !175, templateParams: !23, identifier: "9c68ec629ca43f00f69cd1c83e6a86ee", discriminator: !213)
!175 = !{!176, !209}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !174, file: !2, baseType: !177, size: 128, align: 64, extraData: i64 0)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !171, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !178, identifier: "47cc9dc96ffcd771f05fd8baf8718f9f")
!178 = !{!179}
!179 = !DITemplateTypeParameter(name: "T", type: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !181, templateParams: !23, identifier: "47e0d68c4284c2763bc79684afc58b04")
!181 = !{!182, !208}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !180, file: !2, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64, dwarfAddressSpace: 0)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !185, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !186, templateParams: !23, identifier: "a24e9441b09da4bb466626271bc603ff")
!185 = !DINamespace(name: "rt", scope: !157)
!186 = !{!187, !188, !190, !207}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !184, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !184, file: !2, baseType: !189, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!189 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !184, file: !2, baseType: !191, size: 128, align: 64, flags: DIFlagPublic)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !185, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !192, templateParams: !23, identifier: "40215f7dafe59c81d016b26a091f523c")
!192 = !{!193}
!193 = !DICompositeType(tag: DW_TAG_variant_part, scope: !191, file: !2, size: 128, align: 64, elements: !194, templateParams: !23, identifier: "6d1f0d392a2148b575e310d1f1121c4e", discriminator: !206)
!194 = !{!195, !200, !204}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !193, file: !2, baseType: !196, size: 128, align: 64, extraData: i16 0)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !191, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !197, templateParams: !23, identifier: "eb70fbd88edb38f655d53298908aed8b")
!197 = !{!198}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !196, file: !2, baseType: !199, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!199 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !193, file: !2, baseType: !201, size: 128, align: 64, extraData: i16 1)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !191, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !202, templateParams: !23, identifier: "98b6d299d0747bdfcea62178e60c14d2")
!202 = !{!203}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !201, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !193, file: !2, baseType: !205, size: 128, align: 64, extraData: i16 2)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !191, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, identifier: "b0e7d3bde035ab0cee4c0dd5a5255ff4")
!206 = !DIDerivedType(tag: DW_TAG_member, scope: !191, file: !2, baseType: !199, size: 16, align: 16, flags: DIFlagArtificial)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !184, file: !2, baseType: !191, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !180, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !174, file: !2, baseType: !210, size: 128, align: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !171, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !211, templateParams: !178, identifier: "bf5c5b5bd7587d5644e79af587197807")
!211 = !{!212}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !210, file: !2, baseType: !180, size: 128, align: 64, flags: DIFlagPublic)
!213 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !2, baseType: !57, size: 64, align: 64, flags: DIFlagArtificial)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !156, file: !2, baseType: !215, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !216, templateParams: !23, identifier: "58bf012de0ac0100eebb52b78c8cbe69")
!216 = !{!217, !288}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !215, file: !2, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64, dwarfAddressSpace: 0)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !185, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !220, templateParams: !23, identifier: "a64ebb2da98ad8cd523bf22d581450a0")
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !219, file: !2, baseType: !222, size: 128, align: 64, flags: DIFlagPrivate)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !185, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !223, templateParams: !23, identifier: "a0986c1d8c42330c2ccb6994238d036")
!223 = !{!224}
!224 = !DICompositeType(tag: DW_TAG_variant_part, scope: !222, file: !2, size: 128, align: 64, elements: !225, templateParams: !23, identifier: "4cce771e46b015aa294ea53675c7967", discriminator: !287)
!225 = !{!226, !283}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !224, file: !2, baseType: !227, size: 128, align: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !222, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !228, templateParams: !23, identifier: "32096f5d360ce82abef8f28a1c366c8e")
!228 = !{!229, !236, !277}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !227, file: !2, baseType: !230, size: 64, align: 64, flags: DIFlagPrivate)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !231, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !232, templateParams: !234, identifier: "59004c9764b8f8a0c7eeffd3340ced68")
!231 = !DINamespace(name: "non_null", scope: !55)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !230, file: !2, baseType: !6, size: 64, align: 64, flags: DIFlagPrivate)
!234 = !{!235}
!235 = !DITemplateTypeParameter(name: "T", type: !7)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !227, file: !2, baseType: !237, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(core::ptr::non_null::NonNull<()>, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !238, size: 64, align: 64, dwarfAddressSpace: 0)
!238 = !DISubroutineType(types: !239)
!239 = !{!240, !230, !257}
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !241, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !242, templateParams: !23, identifier: "cc621153baa62273e1d5317cd8c95256")
!241 = !DINamespace(name: "result", scope: !56)
!242 = !{!243}
!243 = !DICompositeType(tag: DW_TAG_variant_part, scope: !240, file: !2, size: 8, align: 8, elements: !244, templateParams: !23, identifier: "97f70f95c44c3df549ad0d94d230cef4", discriminator: !256)
!244 = !{!245, !252}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !243, file: !2, baseType: !246, size: 8, align: 8, extraData: i8 0)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !240, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !247, templateParams: !249, identifier: "ec2f8aa08737d6854b25f87e36015000")
!247 = !{!248}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !246, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!249 = !{!235, !250}
!250 = !DITemplateTypeParameter(name: "E", type: !251)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !157, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "4e10c97380bc1052e26842e514c07b58")
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !243, file: !2, baseType: !253, size: 8, align: 8, extraData: i8 1)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !240, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !254, templateParams: !249, identifier: "5836f172dd113fa0e1839c449d1255a")
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !253, file: !2, baseType: !251, align: 8, offset: 8, flags: DIFlagPublic)
!256 = !DIDerivedType(tag: DW_TAG_member, scope: !240, file: !2, baseType: !36, size: 8, align: 8, flags: DIFlagArtificial)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !258, size: 64, align: 64, dwarfAddressSpace: 0)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !157, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !259, templateParams: !23, identifier: "94e132869bcec4069af040a17a417dc7")
!259 = !{!260, !266}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !258, file: !2, baseType: !261, size: 64, align: 32, offset: 128, flags: DIFlagPrivate)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormattingOptions", scope: !157, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !262, templateParams: !23, identifier: "693054fe9da7b65cbaf8d4db1884220d")
!262 = !{!263, !264, !265}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !261, file: !2, baseType: !189, size: 32, align: 32, flags: DIFlagPrivate)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !261, file: !2, baseType: !199, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !261, file: !2, baseType: !199, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !258, file: !2, baseType: !267, size: 128, align: 64, flags: DIFlagPrivate)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !268, templateParams: !23, identifier: "104810609c399af05a756c8a6780b67e")
!268 = !{!269, !272}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !267, file: !2, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64, dwarfAddressSpace: 0)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "a14cb6e521f593dff04dad945921eaa8")
!272 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !267, file: !2, baseType: !273, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !274, size: 64, align: 64, dwarfAddressSpace: 0)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 384, align: 64, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 6, lowerBound: 0)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_lifetime", scope: !227, file: !2, baseType: !278, align: 8, offset: 128, flags: DIFlagPrivate)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&()>", scope: !279, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !280, identifier: "3353c2e93b9170d7bdb4cbe585bbf9b1")
!279 = !DINamespace(name: "marker", scope: !56)
!280 = !{!281}
!281 = !DITemplateTypeParameter(name: "T", type: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !224, file: !2, baseType: !284, size: 128, align: 64, extraData: i64 0)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !222, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !285, templateParams: !23, identifier: "b3336e3ef853d0e4f5e2fa7ee806da5b")
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !284, file: !2, baseType: !199, size: 16, align: 16, offset: 64, flags: DIFlagPrivate)
!287 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !2, baseType: !57, size: 64, align: 64, flags: DIFlagArtificial)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !215, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!156, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[&str; 1]", baseType: !292, size: 64, align: 64, dwarfAddressSpace: 0)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, align: 64, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 1, lowerBound: 0)
!295 = !DISubprogram(name: "new_const<1>", linkageName: "_ZN4core3fmt2rt38_$LT$impl$u20$core..fmt..Arguments$GT$9new_const17h15464fc7eebfa43bE", scope: !156, file: !155, line: 194, type: !289, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !23)
!296 = !{!153}
!297 = !DILocation(line: 0, scope: !154, inlinedAt: !298)
!298 = !DILocation(line: 9, column: 5, scope: !150)
!299 = !DILocation(line: 3, column: 5, scope: !150)
!300 = !{!301}
!301 = distinct !{!301, !302, !"_ZN2cc5Build4file17h910d492587995a53E: %self"}
!302 = distinct !{!302, !"_ZN2cc5Build4file17h910d492587995a53E"}
!303 = !DILocation(line: 4, column: 6, scope: !150)
!304 = !DILocalVariable(name: "p", arg: 2, scope: !305, file: !306, line: 836, type: !164)
!305 = distinct !DISubprogram(name: "file<&str>", linkageName: "_ZN2cc5Build4file17h910d492587995a53E", scope: !307, file: !306, line: 836, type: !995, scopeLine: 836, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !30, templateParams: !999, declaration: !998, retainedNodes: !1001)
!306 = !DIFile(filename: "/users/ddavis65/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/cc-1.2.45/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "fd8d6943bf6b7fcb5f03c292250a29c6")
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "Build", scope: !35, file: !2, size: 3776, align: 64, flags: DIFlagPublic, elements: !308, templateParams: !23, identifier: "b5d4b0aeb13e6c9721f7764c0c815828")
!308 = !{!309, !400, !452, !453, !490, !491, !492, !493, !495, !496, !497, !511, !512, !513, !514, !515, !516, !517, !518, !519, !531, !532, !546, !547, !564, !565, !566, !567, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !993, !994}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "include_directories", scope: !307, file: !2, baseType: !310, size: 192, align: 64, offset: 192, flags: DIFlagPrivate)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<alloc::sync::Arc<std::path::Path, alloc::alloc::Global>, alloc::alloc::Global>", scope: !311, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !313, templateParams: !398, identifier: "169be43eb40c82f3c0b495ff7ea7ce98")
!311 = !DINamespace(name: "vec", scope: !312)
!312 = !DINamespace(name: "alloc", scope: null)
!313 = !{!314, !399}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !310, file: !2, baseType: !315, size: 128, align: 64, flags: DIFlagPrivate)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<alloc::sync::Arc<std::path::Path, alloc::alloc::Global>, alloc::alloc::Global>", scope: !316, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !317, templateParams: !398, identifier: "e8c7203923ba3113f98f1ce1736d6714")
!316 = !DINamespace(name: "raw_vec", scope: !312)
!317 = !{!318, !345}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !315, file: !2, baseType: !319, size: 128, align: 64, flags: DIFlagPrivate)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVecInner<alloc::alloc::Global>", scope: !316, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !320, templateParams: !343, identifier: "d9b585b851a6ea35649b1d69fe7eae64")
!320 = !{!321, !334, !340}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !319, file: !2, baseType: !322, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !323, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !324, templateParams: !330, identifier: "c3ca02706589197133726e3ebb88f38a")
!323 = !DINamespace(name: "unique", scope: !55)
!324 = !{!325, !332}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !322, file: !2, baseType: !326, size: 64, align: 64, flags: DIFlagPrivate)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !231, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !327, templateParams: !330, identifier: "8a8631ef5a10de98d90eca8cb5e9c24f")
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !326, file: !2, baseType: !329, size: 64, align: 64, flags: DIFlagPrivate)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!330 = !{!331}
!331 = !DITemplateTypeParameter(name: "T", type: !36)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !322, file: !2, baseType: !333, align: 8, offset: 64, flags: DIFlagPrivate)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !279, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !330, identifier: "4ee2ce85d019f8c54e6cb96475ed02e")
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !319, file: !2, baseType: !335, size: 64, align: 64, flags: DIFlagPrivate)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "UsizeNoHighBit", scope: !336, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !338, templateParams: !23, identifier: "fb3cc97d9cfd36835928e5fd70db120e")
!336 = !DINamespace(name: "niche_types", scope: !337)
!337 = !DINamespace(name: "num", scope: !56)
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !335, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !319, file: !2, baseType: !341, align: 8, offset: 128, flags: DIFlagPrivate)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !342, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "261a8454d8f730546a4c59211f97b50b")
!342 = !DINamespace(name: "alloc", scope: !312)
!343 = !{!344}
!344 = !DITemplateTypeParameter(name: "A", type: !341)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !315, file: !2, baseType: !346, align: 8, offset: 128, flags: DIFlagPrivate)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::Arc<std::path::Path, alloc::alloc::Global>>", scope: !279, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !347, identifier: "3bbe6b303d389bb3f4c16d432359403e")
!347 = !{!348}
!348 = !DITemplateTypeParameter(name: "T", type: !349)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::path::Path, alloc::alloc::Global>", scope: !350, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !351, templateParams: !397, identifier: "6d75974034d52afba24b12509148cdb8")
!350 = !DINamespace(name: "sync", scope: !312)
!351 = !{!352, !394, !396}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !349, file: !2, baseType: !353, size: 128, align: 64, flags: DIFlagPrivate)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::path::Path>>", scope: !231, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !354, templateParams: !392, identifier: "26f89bc4994513d85fb483ff1eb8df22")
!354 = !{!355}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !353, file: !2, baseType: !356, size: 128, align: 64, flags: DIFlagPrivate)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const alloc::sync::ArcInner<std::path::Path>", file: !2, size: 128, align: 64, elements: !357, templateParams: !23, identifier: "981b765924b24332b79148a4f70a16ea")
!357 = !{!358, !391}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !356, file: !2, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64, dwarfAddressSpace: 0)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::path::Path>", scope: !350, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !361, templateParams: !389, identifier: "e0883100970daa99c7782bbe691c015e")
!361 = !{!362, !372, !373}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !360, file: !2, baseType: !363, size: 64, align: 64, flags: DIFlagPrivate)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !130, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !364, templateParams: !23, identifier: "eae64ebbcbc496d646b0fd35ea460d51")
!364 = !{!365}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !363, file: !2, baseType: !366, size: 64, align: 64, flags: DIFlagPrivate)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !367, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !368, templateParams: !370, identifier: "e5018d9c15bb29f71f624e9c428147a7")
!367 = !DINamespace(name: "cell", scope: !56)
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !366, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!370 = !{!371}
!371 = !DITemplateTypeParameter(name: "T", type: !9)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !360, file: !2, baseType: !363, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !360, file: !2, baseType: !374, align: 8, offset: 128, flags: DIFlagPrivate)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "Path", scope: !375, file: !2, align: 8, flags: DIFlagPublic, elements: !376, templateParams: !23, identifier: "766b023873ea55762ce11458fca99398")
!375 = !DINamespace(name: "path", scope: !17)
!376 = !{!377}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !374, file: !2, baseType: !378, align: 8, flags: DIFlagPrivate)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "OsStr", scope: !379, file: !2, align: 8, flags: DIFlagPublic, elements: !381, templateParams: !23, identifier: "5154f08aee687ba89db24be1ea9e8a1d")
!379 = !DINamespace(name: "os_str", scope: !380)
!380 = !DINamespace(name: "ffi", scope: !17)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !378, file: !2, baseType: !383, align: 8, flags: DIFlagPrivate)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "Slice", scope: !384, file: !2, align: 8, flags: DIFlagPublic, elements: !387, templateParams: !23, identifier: "ccfd121fa885ee49e7e507ea72630378")
!384 = !DINamespace(name: "bytes", scope: !385)
!385 = !DINamespace(name: "os_str", scope: !386)
!386 = !DINamespace(name: "sys", scope: !17)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !383, file: !2, baseType: !36, align: 8, flags: DIFlagPublic)
!389 = !{!390}
!390 = !DITemplateTypeParameter(name: "T", type: !374)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !356, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!392 = !{!393}
!393 = !DITemplateTypeParameter(name: "T", type: !360)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !349, file: !2, baseType: !395, align: 8, offset: 128, flags: DIFlagPrivate)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::path::Path>>", scope: !279, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !392, identifier: "3cfc00a7155fe9fc357f9da2fd7eb7b9")
!396 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !349, file: !2, baseType: !341, align: 8, offset: 128, flags: DIFlagPrivate)
!397 = !{!390, !344}
!398 = !{!348, !344}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !310, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "definitions", scope: !307, file: !2, baseType: !401, size: 192, align: 64, offset: 384, flags: DIFlagPrivate)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<(alloc::sync::Arc<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<str, alloc::alloc::Global>>), alloc::alloc::Global>", scope: !311, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !402, templateParams: !450, identifier: "de5cf34235e8c3c5759c2920f0473ed4")
!402 = !{!403, !451}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !401, file: !2, baseType: !404, size: 128, align: 64, flags: DIFlagPrivate)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<(alloc::sync::Arc<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<str, alloc::alloc::Global>>), alloc::alloc::Global>", scope: !316, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !405, templateParams: !450, identifier: "6b81c57948f8a0fc4d98c068a18eb0d5")
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !404, file: !2, baseType: !319, size: 128, align: 64, flags: DIFlagPrivate)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !404, file: !2, baseType: !408, align: 8, offset: 128, flags: DIFlagPrivate)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::sync::Arc<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<str, alloc::alloc::Global>>)>", scope: !279, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !409, identifier: "289c51f6dedfe2dd7213d1e339db03b")
!409 = !{!410}
!410 = !DITemplateTypeParameter(name: "T", type: !411)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::sync::Arc<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<str, alloc::alloc::Global>>)", file: !2, size: 256, align: 64, elements: !412, templateParams: !23, identifier: "f28af0c80dea7b1d5752cc4e5e53a0c1")
!412 = !{!413, !436}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !411, file: !2, baseType: !414, size: 128, align: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<str, alloc::alloc::Global>", scope: !350, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !415, templateParams: !435, identifier: "a3dbfadf22048119b9439cbf09e0436b")
!415 = !{!416, !432, !434}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !414, file: !2, baseType: !417, size: 128, align: 64, flags: DIFlagPrivate)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<str>>", scope: !231, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !418, templateParams: !430, identifier: "836d568eb31c0cfdc9f46c5c461f5d87")
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !417, file: !2, baseType: !420, size: 128, align: 64, flags: DIFlagPrivate)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const alloc::sync::ArcInner<str>", file: !2, size: 128, align: 64, elements: !421, templateParams: !23, identifier: "75621cfedbfc50359e80f9e61ff0a948")
!421 = !{!422, !429}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !420, file: !2, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64, dwarfAddressSpace: 0)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<str>", scope: !350, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !425, templateParams: !330, identifier: "5fef3dc607303a9dedc2f19545e95f2")
!425 = !{!426, !427, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !424, file: !2, baseType: !363, size: 64, align: 64, flags: DIFlagPrivate)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !424, file: !2, baseType: !363, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !424, file: !2, baseType: !36, align: 8, offset: 128, flags: DIFlagPrivate)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !420, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!430 = !{!431}
!431 = !DITemplateTypeParameter(name: "T", type: !424)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !414, file: !2, baseType: !433, align: 8, offset: 128, flags: DIFlagPrivate)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<str>>", scope: !279, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !430, identifier: "4b9727144e7fb093e502be2d69cf9ee3")
!434 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !414, file: !2, baseType: !341, align: 8, offset: 128, flags: DIFlagPrivate)
!435 = !{!331, !344}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !411, file: !2, baseType: !437, size: 128, align: 64, offset: 128)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<str, alloc::alloc::Global>>", scope: !172, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !438, templateParams: !23, identifier: "d9b2ab4da4fa3be11640da147bda94cb")
!438 = !{!439}
!439 = !DICompositeType(tag: DW_TAG_variant_part, scope: !437, file: !2, size: 128, align: 64, elements: !440, templateParams: !23, identifier: "92fff633fa898a3b34726b51ce9fa4ec", discriminator: !449)
!440 = !{!441, !445}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !439, file: !2, baseType: !442, size: 128, align: 64, extraData: i64 0)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !437, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !443, identifier: "8f906e4ad3a38c8516cc45ceed171d26")
!443 = !{!444}
!444 = !DITemplateTypeParameter(name: "T", type: !414)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !439, file: !2, baseType: !446, size: 128, align: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !437, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !447, templateParams: !443, identifier: "88c279fcce75ffa6f3f12507220fc845")
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !446, file: !2, baseType: !414, size: 128, align: 64, flags: DIFlagPublic)
!449 = !DIDerivedType(tag: DW_TAG_member, scope: !437, file: !2, baseType: !57, size: 64, align: 64, flags: DIFlagArtificial)
!450 = !{!410, !344}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !401, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !307, file: !2, baseType: !310, size: 192, align: 64, offset: 576, flags: DIFlagPrivate)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !307, file: !2, baseType: !454, size: 192, align: 64, offset: 768, flags: DIFlagPrivate)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>, alloc::alloc::Global>", scope: !311, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !455, templateParams: !488, identifier: "6081fcf7252f304b4be295ca03818395")
!455 = !{!456, !489}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !454, file: !2, baseType: !457, size: 128, align: 64, flags: DIFlagPrivate)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>, alloc::alloc::Global>", scope: !316, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !458, templateParams: !488, identifier: "492e8b112ff24d493e4fe17b77bf9c2")
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !457, file: !2, baseType: !319, size: 128, align: 64, flags: DIFlagPrivate)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !457, file: !2, baseType: !461, align: 8, offset: 128, flags: DIFlagPrivate)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>>", scope: !279, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !462, identifier: "c45f14030b6de0229d8467e693d6e7d9")
!462 = !{!463}
!463 = !DITemplateTypeParameter(name: "T", type: !464)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>", scope: !350, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !465, templateParams: !487, identifier: "616c6211c59fa8f34500e83267e95274")
!465 = !{!466, !484, !486}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !464, file: !2, baseType: !467, size: 128, align: 64, flags: DIFlagPrivate)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::ffi::os_str::OsStr>>", scope: !231, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !468, templateParams: !482, identifier: "ab811a19e5ef0ef794df758cc9e292e4")
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !467, file: !2, baseType: !470, size: 128, align: 64, flags: DIFlagPrivate)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const alloc::sync::ArcInner<std::ffi::os_str::OsStr>", file: !2, size: 128, align: 64, elements: !471, templateParams: !23, identifier: "45f177846f761e44baf44bf0cb3f4649")
!471 = !{!472, !481}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !470, file: !2, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64, dwarfAddressSpace: 0)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::ffi::os_str::OsStr>", scope: !350, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !475, templateParams: !479, identifier: "4c5e54148f1a962eec6428a7f1df07")
!475 = !{!476, !477, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !474, file: !2, baseType: !363, size: 64, align: 64, flags: DIFlagPrivate)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !474, file: !2, baseType: !363, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !474, file: !2, baseType: !378, align: 8, offset: 128, flags: DIFlagPrivate)
!479 = !{!480}
!480 = !DITemplateTypeParameter(name: "T", type: !378)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !470, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!482 = !{!483}
!483 = !DITemplateTypeParameter(name: "T", type: !474)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !464, file: !2, baseType: !485, align: 8, offset: 128, flags: DIFlagPrivate)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::ffi::os_str::OsStr>>", scope: !279, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !482, identifier: "3d7aa247ac780c2adc23a70eb7e6e864")
!486 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !464, file: !2, baseType: !341, align: 8, offset: 128, flags: DIFlagPrivate)
!487 = !{!480, !344}
!488 = !{!463, !344}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !454, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "flags_supported", scope: !307, file: !2, baseType: !454, size: 192, align: 64, offset: 960, flags: DIFlagPrivate)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ar_flags", scope: !307, file: !2, baseType: !454, size: 192, align: 64, offset: 1152, flags: DIFlagPrivate)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "asm_flags", scope: !307, file: !2, baseType: !454, size: 192, align: 64, offset: 1344, flags: DIFlagPrivate)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "no_default_flags", scope: !307, file: !2, baseType: !494, size: 8, align: 8, offset: 3584, flags: DIFlagPrivate)
!494 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !307, file: !2, baseType: !310, size: 192, align: 64, offset: 1536, flags: DIFlagPrivate)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "cpp", scope: !307, file: !2, baseType: !494, size: 8, align: 8, offset: 3592, flags: DIFlagPrivate)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "cpp_link_stdlib", scope: !307, file: !2, baseType: !498, size: 192, align: 64, flags: DIFlagPrivate)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::option::Option<alloc::sync::Arc<str, alloc::alloc::Global>>>", scope: !172, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !499, templateParams: !23, identifier: "a1639ec80add1483a698836064447a17")
!499 = !{!500}
!500 = !DICompositeType(tag: DW_TAG_variant_part, scope: !498, file: !2, size: 192, align: 64, elements: !501, templateParams: !23, identifier: "872de23cd1983f30b0f0fff6a5e55597", discriminator: !510)
!501 = !{!502, !506}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !500, file: !2, baseType: !503, size: 192, align: 64, extraData: i64 0)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !498, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !504, identifier: "f79c478e2fe859c0b139645b2a095fed")
!504 = !{!505}
!505 = !DITemplateTypeParameter(name: "T", type: !437)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !500, file: !2, baseType: !507, size: 192, align: 64, extraData: i64 1)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !498, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !508, templateParams: !504, identifier: "a197fd526188447ff4028c0f526122da")
!508 = !{!509}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !507, file: !2, baseType: !437, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!510 = !DIDerivedType(tag: DW_TAG_member, scope: !498, file: !2, baseType: !57, size: 64, align: 64, flags: DIFlagArtificial)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cpp_link_stdlib_static", scope: !307, file: !2, baseType: !494, size: 8, align: 8, offset: 3600, flags: DIFlagPrivate)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "cpp_set_stdlib", scope: !307, file: !2, baseType: !437, size: 128, align: 64, offset: 2304, flags: DIFlagPrivate)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "cuda", scope: !307, file: !2, baseType: !494, size: 8, align: 8, offset: 3608, flags: DIFlagPrivate)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "cudart", scope: !307, file: !2, baseType: !437, size: 128, align: 64, offset: 2432, flags: DIFlagPrivate)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ccbin", scope: !307, file: !2, baseType: !494, size: 8, align: 8, offset: 3616, flags: DIFlagPrivate)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "std", scope: !307, file: !2, baseType: !437, size: 128, align: 64, offset: 2560, flags: DIFlagPrivate)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !307, file: !2, baseType: !437, size: 128, align: 64, offset: 2688, flags: DIFlagPrivate)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !307, file: !2, baseType: !437, size: 128, align: 64, offset: 2816, flags: DIFlagPrivate)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "out_dir", scope: !307, file: !2, baseType: !520, size: 128, align: 64, offset: 2944, flags: DIFlagPrivate)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::path::Path, alloc::alloc::Global>>", scope: !172, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !521, templateParams: !23, identifier: "c51097c9105665d52dcab958982b1de7")
!521 = !{!522}
!522 = !DICompositeType(tag: DW_TAG_variant_part, scope: !520, file: !2, size: 128, align: 64, elements: !523, templateParams: !23, identifier: "811f68f5c10c09da569f3d52b584ecae", discriminator: !530)
!523 = !{!524, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !522, file: !2, baseType: !525, size: 128, align: 64, extraData: i64 0)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !520, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !347, identifier: "42bfe15c56cd4f916197af3e586aeca9")
!526 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !522, file: !2, baseType: !527, size: 128, align: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !520, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !528, templateParams: !347, identifier: "f4554bdcaa7da7f562f3455acda293ed")
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !527, file: !2, baseType: !349, size: 128, align: 64, flags: DIFlagPublic)
!530 = !DIDerivedType(tag: DW_TAG_member, scope: !520, file: !2, baseType: !57, size: 64, align: 64, flags: DIFlagArtificial)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "opt_level", scope: !307, file: !2, baseType: !437, size: 128, align: 64, offset: 3072, flags: DIFlagPrivate)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !307, file: !2, baseType: !533, size: 8, align: 8, offset: 3656, flags: DIFlagPrivate)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<bool>", scope: !172, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !534, templateParams: !23, identifier: "772d317590e25d21e26f1907f55e2bf1")
!534 = !{!535}
!535 = !DICompositeType(tag: DW_TAG_variant_part, scope: !533, file: !2, size: 8, align: 8, elements: !536, templateParams: !23, identifier: "170b209cc5c76528bbab24ba9de20b85", discriminator: !545)
!536 = !{!537, !541}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !535, file: !2, baseType: !538, size: 8, align: 8, extraData: i8 2)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !533, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !539, identifier: "5427e14797586b68b47d476e248a2506")
!539 = !{!540}
!540 = !DITemplateTypeParameter(name: "T", type: !494)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !535, file: !2, baseType: !542, size: 8, align: 8)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !533, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !543, templateParams: !539, identifier: "9e8542303fbcf88d132abcdafbe54c92")
!543 = !{!544}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !542, file: !2, baseType: !494, size: 8, align: 8, flags: DIFlagPublic)
!545 = !DIDerivedType(tag: DW_TAG_member, scope: !533, file: !2, baseType: !36, size: 8, align: 8, flags: DIFlagArtificial)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "force_frame_pointer", scope: !307, file: !2, baseType: !533, size: 8, align: 8, offset: 3664, flags: DIFlagPrivate)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !307, file: !2, baseType: !548, size: 192, align: 64, offset: 1728, flags: DIFlagPrivate)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<(alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>), alloc::alloc::Global>", scope: !311, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !549, templateParams: !562, identifier: "59d6f15bb060fcd8153bec543e363ef0")
!549 = !{!550, !563}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !548, file: !2, baseType: !551, size: 128, align: 64, flags: DIFlagPrivate)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<(alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>), alloc::alloc::Global>", scope: !316, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !552, templateParams: !562, identifier: "e470d5b0eae9cb3654efe9ec20bed349")
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !551, file: !2, baseType: !319, size: 128, align: 64, flags: DIFlagPrivate)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !551, file: !2, baseType: !555, align: 8, offset: 128, flags: DIFlagPrivate)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>)>", scope: !279, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !556, identifier: "aae1fc46db4143403a858706a14604dc")
!556 = !{!557}
!557 = !DITemplateTypeParameter(name: "T", type: !558)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>)", file: !2, size: 256, align: 64, elements: !559, templateParams: !23, identifier: "39566db2f19e96f31e5027b3a6c7827b")
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !558, file: !2, baseType: !464, size: 128, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !558, file: !2, baseType: !464, size: 128, align: 64, offset: 128)
!562 = !{!557, !344}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !548, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "compiler", scope: !307, file: !2, baseType: !520, size: 128, align: 64, offset: 3200, flags: DIFlagPrivate)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "archiver", scope: !307, file: !2, baseType: !520, size: 128, align: 64, offset: 3328, flags: DIFlagPrivate)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ranlib", scope: !307, file: !2, baseType: !520, size: 128, align: 64, offset: 3456, flags: DIFlagPrivate)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "cargo_output", scope: !307, file: !2, baseType: !568, size: 128, align: 64, offset: 2112, flags: DIFlagPrivate)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "CargoOutput", scope: !34, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !569, templateParams: !23, identifier: "39d07cd7df94c3ef13ac8925e194c8da")
!569 = !{!570, !571, !572, !573, !574}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !568, file: !2, baseType: !494, size: 8, align: 8, offset: 72, flags: DIFlagProtected)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "warnings", scope: !568, file: !2, baseType: !494, size: 8, align: 8, offset: 80, flags: DIFlagProtected)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !568, file: !2, baseType: !494, size: 8, align: 8, offset: 88, flags: DIFlagProtected)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !568, file: !2, baseType: !33, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "checked_dbg_var", scope: !568, file: !2, baseType: !575, size: 64, align: 64, flags: DIFlagPrivate)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<core::sync::atomic::AtomicBool, alloc::alloc::Global>", scope: !350, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !576, templateParams: !600, identifier: "f405a67b8b4a2ec77d46be42ae600dcf")
!576 = !{!577, !597, !599}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !575, file: !2, baseType: !578, size: 64, align: 64, flags: DIFlagPrivate)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<core::sync::atomic::AtomicBool>>", scope: !231, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !579, templateParams: !595, identifier: "b3afd84380da313e1adc3dc6ce91bd14")
!579 = !{!580}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !578, file: !2, baseType: !581, size: 64, align: 64, flags: DIFlagPrivate)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<core::sync::atomic::AtomicBool>", baseType: !582, size: 64, align: 64, dwarfAddressSpace: 0)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<core::sync::atomic::AtomicBool>", scope: !350, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !583, templateParams: !593, identifier: "53856134a1a00a2c3130668a81a37f1")
!583 = !{!584, !585, !586}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !582, file: !2, baseType: !363, size: 64, align: 64, flags: DIFlagPrivate)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !582, file: !2, baseType: !363, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !582, file: !2, baseType: !587, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !130, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !588, templateParams: !23, identifier: "aad596fa579fb3ef7975ae22b619b34f")
!588 = !{!589}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !587, file: !2, baseType: !590, size: 8, align: 8, flags: DIFlagPrivate)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !367, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !591, templateParams: !330, identifier: "41975b1770026326e44dcb3950af7976")
!591 = !{!592}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !590, file: !2, baseType: !36, size: 8, align: 8, flags: DIFlagPrivate)
!593 = !{!594}
!594 = !DITemplateTypeParameter(name: "T", type: !587)
!595 = !{!596}
!596 = !DITemplateTypeParameter(name: "T", type: !582)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !575, file: !2, baseType: !598, align: 8, offset: 64, flags: DIFlagPrivate)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<core::sync::atomic::AtomicBool>>", scope: !279, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !595, identifier: "7818f2f6e3b8a15c5c4697bcb09088a")
!599 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !575, file: !2, baseType: !341, align: 8, offset: 64, flags: DIFlagPrivate)
!600 = !{!594, !344}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "link_lib_modifiers", scope: !307, file: !2, baseType: !454, size: 192, align: 64, offset: 1920, flags: DIFlagPrivate)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !307, file: !2, baseType: !533, size: 8, align: 8, offset: 3672, flags: DIFlagPrivate)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "use_plt", scope: !307, file: !2, baseType: !533, size: 8, align: 8, offset: 3680, flags: DIFlagPrivate)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "static_crt", scope: !307, file: !2, baseType: !533, size: 8, align: 8, offset: 3688, flags: DIFlagPrivate)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "shared_flag", scope: !307, file: !2, baseType: !533, size: 8, align: 8, offset: 3696, flags: DIFlagPrivate)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !307, file: !2, baseType: !533, size: 8, align: 8, offset: 3704, flags: DIFlagPrivate)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "warnings_into_errors", scope: !307, file: !2, baseType: !494, size: 8, align: 8, offset: 3624, flags: DIFlagPrivate)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "warnings", scope: !307, file: !2, baseType: !533, size: 8, align: 8, offset: 3712, flags: DIFlagPrivate)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "extra_warnings", scope: !307, file: !2, baseType: !533, size: 8, align: 8, offset: 3720, flags: DIFlagPrivate)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "emit_rerun_if_env_changed", scope: !307, file: !2, baseType: !494, size: 8, align: 8, offset: 3632, flags: DIFlagPrivate)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "shell_escaped_flags", scope: !307, file: !2, baseType: !533, size: 8, align: 8, offset: 3728, flags: DIFlagPrivate)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "build_cache", scope: !307, file: !2, baseType: !613, size: 64, align: 64, offset: 2240, flags: DIFlagPrivate)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<cc::BuildCache, alloc::alloc::Global>", scope: !350, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !614, templateParams: !992, identifier: "9a00576846d1d73434aadf9a7f3ff468")
!614 = !{!615, !989, !991}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !613, file: !2, baseType: !616, size: 64, align: 64, flags: DIFlagPrivate)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<cc::BuildCache>>", scope: !231, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !617, templateParams: !987, identifier: "88669ecc30468c5cd625fe379e73eeef")
!617 = !{!618}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !616, file: !2, baseType: !619, size: 64, align: 64, flags: DIFlagPrivate)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<cc::BuildCache>", baseType: !620, size: 64, align: 64, dwarfAddressSpace: 0)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<cc::BuildCache>", scope: !350, file: !2, size: 3520, align: 64, flags: DIFlagPrivate, elements: !621, templateParams: !985, identifier: "448b44a1c4a9d55add0bafc0207974f")
!621 = !{!622, !623, !624}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !620, file: !2, baseType: !363, size: 64, align: 64, flags: DIFlagPrivate)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !620, file: !2, baseType: !363, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !620, file: !2, baseType: !625, size: 3392, align: 64, offset: 128, flags: DIFlagPrivate)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuildCache", scope: !35, file: !2, size: 3392, align: 64, flags: DIFlagPrivate, elements: !626, templateParams: !23, identifier: "dc91edc2a83a2d5f3ff4a6b74c2cd01")
!626 = !{!627, !717, !751, !785, !846, !890}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "env_cache", scope: !625, file: !2, baseType: !628, size: 512, align: 64, flags: DIFlagPrivate)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "RwLock<std::collections::hash::map::HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>>, std::hash::random::RandomState>>", scope: !629, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !632, templateParams: !715, identifier: "8ef322b50c1fb09c6dff7e1c7d9771f9")
!629 = !DINamespace(name: "rwlock", scope: !630)
!630 = !DINamespace(name: "poison", scope: !631)
!631 = !DINamespace(name: "sync", scope: !17)
!632 = !{!633, !649, !653}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !628, file: !2, baseType: !634, size: 64, align: 32, flags: DIFlagPrivate)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "RwLock", scope: !635, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !638, templateParams: !23, identifier: "6dd8a4be2163a8019a9001be08ddebe4")
!635 = !DINamespace(name: "futex", scope: !636)
!636 = !DINamespace(name: "rwlock", scope: !637)
!637 = !DINamespace(name: "sync", scope: !386)
!638 = !{!639, !648}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !634, file: !2, baseType: !640, size: 32, align: 32, flags: DIFlagPrivate)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU32", scope: !130, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !641, templateParams: !23, identifier: "566f94d0954c7af36112814fe73b6f1d")
!641 = !{!642}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !640, file: !2, baseType: !643, size: 32, align: 32, flags: DIFlagPrivate)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !367, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !644, templateParams: !646, identifier: "b4b53e8b86ad10aba62b0135bb6058f8")
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !643, file: !2, baseType: !189, size: 32, align: 32, flags: DIFlagPrivate)
!646 = !{!647}
!647 = !DITemplateTypeParameter(name: "T", type: !189)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "writer_notify", scope: !634, file: !2, baseType: !640, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !628, file: !2, baseType: !650, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !630, file: !2, size: 8, align: 8, flags: DIFlagProtected, elements: !651, templateParams: !23, identifier: "d43cb1817b9b2c947889a2ae92de5ec7")
!651 = !{!652}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !650, file: !2, baseType: !587, size: 8, align: 8, flags: DIFlagPrivate)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !628, file: !2, baseType: !654, size: 384, align: 64, offset: 128, flags: DIFlagPrivate)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::collections::hash::map::HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>>, std::hash::random::RandomState>>", scope: !367, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !655, templateParams: !715, identifier: "8476ffa3ef8160346293ac4fbddb122c")
!655 = !{!656}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !654, file: !2, baseType: !657, size: 384, align: 64, flags: DIFlagPrivate)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>>, std::hash::random::RandomState>", scope: !658, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !661, templateParams: !714, identifier: "f565e2b0c5075b2aa003393f2ff0d9e4")
!658 = !DINamespace(name: "map", scope: !659)
!659 = !DINamespace(name: "hash", scope: !660)
!660 = !DINamespace(name: "collections", scope: !17)
!661 = !{!662}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !657, file: !2, baseType: !663, size: 384, align: 64, flags: DIFlagPrivate)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>>, std::hash::random::RandomState, alloc::alloc::Global>", scope: !664, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !666, templateParams: !710, identifier: "9f1e9d121059a2f6e9313944100b4d01")
!664 = !DINamespace(name: "map", scope: !665)
!665 = !DINamespace(name: "hashbrown", scope: null)
!666 = !{!667, !674}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !663, file: !2, baseType: !668, size: 128, align: 64, offset: 256, flags: DIFlagProtected)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "RandomState", scope: !669, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !671, templateParams: !23, identifier: "55e22eb5ad0303a350f9ff3a30cebf1e")
!669 = !DINamespace(name: "random", scope: !670)
!670 = !DINamespace(name: "hash", scope: !17)
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "k0", scope: !668, file: !2, baseType: !57, size: 64, align: 64, flags: DIFlagPrivate)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !668, file: !2, baseType: !57, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !663, file: !2, baseType: !675, size: 256, align: 64, flags: DIFlagProtected)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTable<(alloc::boxed::Box<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>>), alloc::alloc::Global>", scope: !676, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !677, templateParams: !709, identifier: "23798447a3d7485caa302fa7fac44b26")
!676 = !DINamespace(name: "raw", scope: !665)
!677 = !{!678, !685, !686}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !675, file: !2, baseType: !679, size: 256, align: 64, flags: DIFlagPrivate)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTableInner", scope: !676, file: !2, size: 256, align: 64, flags: DIFlagPrivate, elements: !680, templateParams: !23, identifier: "62b7ba5b5bcf742865447323f46bb6e2")
!680 = !{!681, !682, !683, !684}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_mask", scope: !679, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !679, file: !2, baseType: !326, size: 64, align: 64, flags: DIFlagPrivate)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "growth_left", scope: !679, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !679, file: !2, baseType: !9, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !675, file: !2, baseType: !341, align: 8, offset: 256, flags: DIFlagPrivate)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !675, file: !2, baseType: !687, align: 8, offset: 256, flags: DIFlagPrivate)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::boxed::Box<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>>)>", scope: !279, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !688, identifier: "70f69f1863f9384cef9aff3cfa13551b")
!688 = !{!689}
!689 = !DITemplateTypeParameter(name: "T", type: !690)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::boxed::Box<str, alloc::alloc::Global>, core::option::Option<alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>>)", file: !2, size: 256, align: 64, elements: !691, templateParams: !23, identifier: "87ea1e6941080566a22587c9deb636a9")
!691 = !{!692, !697}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !690, file: !2, baseType: !693, size: 128, align: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<str, alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !694, templateParams: !23, identifier: "9623b0fa9780e7d13158910d090ae516")
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !693, file: !2, baseType: !167, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !693, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !690, file: !2, baseType: !698, size: 128, align: 64, offset: 128)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>>", scope: !172, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !699, templateParams: !23, identifier: "73a554cec6724e797a38fa2d2b12f3e6")
!699 = !{!700}
!700 = !DICompositeType(tag: DW_TAG_variant_part, scope: !698, file: !2, size: 128, align: 64, elements: !701, templateParams: !23, identifier: "4818b0b2c15639eef9d22116d9c4c399", discriminator: !708)
!701 = !{!702, !704}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !700, file: !2, baseType: !703, size: 128, align: 64, extraData: i64 0)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !698, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !462, identifier: "97b9cf2f4b09f93e885ee9b77dd43f05")
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !700, file: !2, baseType: !705, size: 128, align: 64)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !698, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !706, templateParams: !462, identifier: "31dbab0fc219276adb2c9da1b7f5688e")
!706 = !{!707}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !705, file: !2, baseType: !464, size: 128, align: 64, flags: DIFlagPublic)
!708 = !DIDerivedType(tag: DW_TAG_member, scope: !698, file: !2, baseType: !57, size: 64, align: 64, flags: DIFlagArtificial)
!709 = !{!689, !344}
!710 = !{!711, !712, !713, !344}
!711 = !DITemplateTypeParameter(name: "K", type: !693)
!712 = !DITemplateTypeParameter(name: "V", type: !698)
!713 = !DITemplateTypeParameter(name: "S", type: !668)
!714 = !{!711, !712, !713}
!715 = !{!716}
!716 = !DITemplateTypeParameter(name: "T", type: !657)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "apple_sdk_root_cache", scope: !625, file: !2, baseType: !718, size: 512, align: 64, offset: 512, flags: DIFlagPrivate)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "RwLock<std::collections::hash::map::HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>, std::hash::random::RandomState>>", scope: !629, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !719, templateParams: !749, identifier: "1cfe3d476e768367ff4c473e9f003d75")
!719 = !{!720, !721, !722}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !718, file: !2, baseType: !634, size: 64, align: 32, flags: DIFlagPrivate)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !718, file: !2, baseType: !650, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !718, file: !2, baseType: !723, size: 384, align: 64, offset: 128, flags: DIFlagPrivate)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::collections::hash::map::HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>, std::hash::random::RandomState>>", scope: !367, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !724, templateParams: !749, identifier: "5da7ca66b3f60f13301d9f3be318f94c")
!724 = !{!725}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !723, file: !2, baseType: !726, size: 384, align: 64, flags: DIFlagPrivate)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>, std::hash::random::RandomState>", scope: !658, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !727, templateParams: !748, identifier: "f0cec013e9f717838ba443267e2c090e")
!727 = !{!728}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !726, file: !2, baseType: !729, size: 384, align: 64, flags: DIFlagPrivate)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>, std::hash::random::RandomState, alloc::alloc::Global>", scope: !664, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !730, templateParams: !746, identifier: "4a6641b5fa91380a5b794ee6b2aed4f0")
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !729, file: !2, baseType: !668, size: 128, align: 64, offset: 256, flags: DIFlagProtected)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !729, file: !2, baseType: !733, size: 256, align: 64, flags: DIFlagProtected)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTable<(alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>), alloc::alloc::Global>", scope: !676, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !734, templateParams: !745, identifier: "ec0dc8cc24dfaa2fe4dba3011919de93")
!734 = !{!735, !736, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !733, file: !2, baseType: !679, size: 256, align: 64, flags: DIFlagPrivate)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !733, file: !2, baseType: !341, align: 8, offset: 256, flags: DIFlagPrivate)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !733, file: !2, baseType: !738, align: 8, offset: 256, flags: DIFlagPrivate)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>)>", scope: !279, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !739, identifier: "449bfe223ac9e7b97dff229b501195ea")
!739 = !{!740}
!740 = !DITemplateTypeParameter(name: "T", type: !741)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<std::ffi::os_str::OsStr, alloc::alloc::Global>)", file: !2, size: 256, align: 64, elements: !742, templateParams: !23, identifier: "3db942d0247330f3c155dd71578f4c53")
!742 = !{!743, !744}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !741, file: !2, baseType: !693, size: 128, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !741, file: !2, baseType: !464, size: 128, align: 64, offset: 128)
!745 = !{!740, !344}
!746 = !{!711, !747, !713, !344}
!747 = !DITemplateTypeParameter(name: "V", type: !464)
!748 = !{!711, !747, !713}
!749 = !{!750}
!750 = !DITemplateTypeParameter(name: "T", type: !726)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "apple_versions_cache", scope: !625, file: !2, baseType: !752, size: 512, align: 64, offset: 1024, flags: DIFlagPrivate)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "RwLock<std::collections::hash::map::HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<str, alloc::alloc::Global>, std::hash::random::RandomState>>", scope: !629, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !753, templateParams: !783, identifier: "47309e86344b546c485dd23a6f6d9a5e")
!753 = !{!754, !755, !756}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !752, file: !2, baseType: !634, size: 64, align: 32, flags: DIFlagPrivate)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !752, file: !2, baseType: !650, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !752, file: !2, baseType: !757, size: 384, align: 64, offset: 128, flags: DIFlagPrivate)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::collections::hash::map::HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<str, alloc::alloc::Global>, std::hash::random::RandomState>>", scope: !367, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !758, templateParams: !783, identifier: "e02c5df639d3332bba0728e2986aad43")
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !757, file: !2, baseType: !760, size: 384, align: 64, flags: DIFlagPrivate)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<str, alloc::alloc::Global>, std::hash::random::RandomState>", scope: !658, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !761, templateParams: !782, identifier: "ab6630fa4015163622a9a34497fd0c31")
!761 = !{!762}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !760, file: !2, baseType: !763, size: 384, align: 64, flags: DIFlagPrivate)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<str, alloc::alloc::Global>, std::hash::random::RandomState, alloc::alloc::Global>", scope: !664, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !764, templateParams: !780, identifier: "8fbe8abd75ff5158c342a3948924a0fe")
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !763, file: !2, baseType: !668, size: 128, align: 64, offset: 256, flags: DIFlagProtected)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !763, file: !2, baseType: !767, size: 256, align: 64, flags: DIFlagProtected)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTable<(alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<str, alloc::alloc::Global>), alloc::alloc::Global>", scope: !676, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !768, templateParams: !779, identifier: "41f0f5834e5a0803635bdc717dc23149")
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !767, file: !2, baseType: !679, size: 256, align: 64, flags: DIFlagPrivate)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !767, file: !2, baseType: !341, align: 8, offset: 256, flags: DIFlagPrivate)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !767, file: !2, baseType: !772, align: 8, offset: 256, flags: DIFlagPrivate)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<str, alloc::alloc::Global>)>", scope: !279, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !773, identifier: "1e43ff52318e2578a3699a67734ecb54")
!773 = !{!774}
!774 = !DITemplateTypeParameter(name: "T", type: !775)
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::boxed::Box<str, alloc::alloc::Global>, alloc::sync::Arc<str, alloc::alloc::Global>)", file: !2, size: 256, align: 64, elements: !776, templateParams: !23, identifier: "bf6ceab291299da766e4bd54fe0326f5")
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !775, file: !2, baseType: !693, size: 128, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !775, file: !2, baseType: !414, size: 128, align: 64, offset: 128)
!779 = !{!774, !344}
!780 = !{!711, !781, !713, !344}
!781 = !DITemplateTypeParameter(name: "V", type: !414)
!782 = !{!711, !781, !713}
!783 = !{!784}
!784 = !DITemplateTypeParameter(name: "T", type: !760)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "cached_compiler_family", scope: !625, file: !2, baseType: !786, size: 512, align: 64, offset: 1536, flags: DIFlagPrivate)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "RwLock<std::collections::hash::map::HashMap<alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>, cc::tool::ToolFamily, std::hash::random::RandomState>>", scope: !629, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !787, templateParams: !844, identifier: "7b1633d6f383d83caf993b80a8803fb")
!787 = !{!788, !789, !790}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !786, file: !2, baseType: !634, size: 64, align: 32, flags: DIFlagPrivate)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !786, file: !2, baseType: !650, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !786, file: !2, baseType: !791, size: 384, align: 64, offset: 128, flags: DIFlagPrivate)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::collections::hash::map::HashMap<alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>, cc::tool::ToolFamily, std::hash::random::RandomState>>", scope: !367, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !792, templateParams: !844, identifier: "185bfcc8d63413e06fc552ca00d2062")
!792 = !{!793}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !791, file: !2, baseType: !794, size: 384, align: 64, flags: DIFlagPrivate)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>, cc::tool::ToolFamily, std::hash::random::RandomState>", scope: !658, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !795, templateParams: !843, identifier: "26e82e3800ad2a954e1a063586ef8d1d")
!795 = !{!796}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !794, file: !2, baseType: !797, size: 384, align: 64, flags: DIFlagPrivate)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>, cc::tool::ToolFamily, std::hash::random::RandomState, alloc::alloc::Global>", scope: !664, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !798, templateParams: !840, identifier: "7241854623013e7b519a60fda21e283d")
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !797, file: !2, baseType: !668, size: 128, align: 64, offset: 256, flags: DIFlagProtected)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !797, file: !2, baseType: !801, size: 256, align: 64, flags: DIFlagProtected)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTable<(alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>, cc::tool::ToolFamily), alloc::alloc::Global>", scope: !676, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !802, templateParams: !839, identifier: "33896fba784db94e79277fa58f0c0cf4")
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !801, file: !2, baseType: !679, size: 256, align: 64, flags: DIFlagPrivate)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !801, file: !2, baseType: !341, align: 8, offset: 256, flags: DIFlagPrivate)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !801, file: !2, baseType: !806, align: 8, offset: 256, flags: DIFlagPrivate)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>, cc::tool::ToolFamily)>", scope: !279, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !807, identifier: "c271c03004e267423c2ca6955dd55677")
!807 = !{!808}
!808 = !DITemplateTypeParameter(name: "T", type: !809)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>, cc::tool::ToolFamily)", file: !2, size: 192, align: 64, elements: !810, templateParams: !23, identifier: "26f4a6ee68098a938c3e0a62199dde3b")
!810 = !{!811, !822}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !809, file: !2, baseType: !812, size: 128, align: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !813, templateParams: !23, identifier: "9282b474ef7b1567f6f8f99f535e386f")
!813 = !{!814, !821}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !812, file: !2, baseType: !815, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64, align: 64, dwarfAddressSpace: 0)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<std::ffi::os_str::OsStr, alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !817, templateParams: !23, identifier: "e99876a15ccfcf43075b259ef98863c")
!817 = !{!818, !820}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !816, file: !2, baseType: !819, size: 64, align: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64, dwarfAddressSpace: 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !816, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !812, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !809, file: !2, baseType: !823, size: 16, align: 8, offset: 128)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "ToolFamily", scope: !824, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !825, templateParams: !23, identifier: "81e7721567fe46d68c19fc2e69698eb0")
!824 = !DINamespace(name: "tool", scope: !35)
!825 = !{!826}
!826 = !DICompositeType(tag: DW_TAG_variant_part, scope: !823, file: !2, size: 16, align: 8, elements: !827, templateParams: !23, identifier: "1b4a397c4a70fd925febb44fea4ab4e4", discriminator: !838)
!827 = !{!828, !830, !834}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "Gnu", scope: !826, file: !2, baseType: !829, size: 16, align: 8, extraData: i8 0)
